OpenNuvoton/NuTool-PinConfigure/Header/NUC1311/sys.h
#define SYS_GPA_MFP_PA0_UART5_TXD   (1UL<<0)            /*!< GPA_MFP PA.0 setting for UART5_TXD */
#define SYS_ALT_MFP_PA0_UART5_TXD   0UL                 /*!< No ALT_MFP setting for PA.0 */
#define SYS_ALT_MFP1_PA0_UART5_TXD  0UL                 /*!< No ALT_MFP1 setting for PA.0 */
#define SYS_ALT_MFP2_PA0_UART5_TXD  0UL                 /*!< No ALT_MFP2 setting for PA.0 */
#define SYS_ALT_MFP3_PA0_UART5_TXD  0x00000000UL        /*!< ALT_MFP3 PA.0 setting for UART5_TXD */
#define SYS_ALT_MFP4_PA0_UART5_TXD  (1UL<<7)            /*!< ALT_MFP4 PA.0 setting for UART5_TXD */

#define SYS_GPA_MFP_PA0_PWM0_CH4    (1UL<<0)            /*!< GPA_MFP PA.0 setting for PWM0_CH4 */
#define SYS_ALT_MFP_PA0_PWM0_CH4    0UL                 /*!< No ALT_MFP setting for PA.0 */
#define SYS_ALT_MFP1_PA0_PWM0_CH4   0UL                 /*!< No ALT_MFP1 setting for PA.0 */
#define SYS_ALT_MFP2_PA0_PWM0_CH4   0UL                 /*!< No ALT_MFP2 setting for PA.0 */
#define SYS_ALT_MFP3_PA0_PWM0_CH4   (1UL<<4)            /*!< ALT_MFP3 PA.0 setting for PWM0_CH4 */
#define SYS_ALT_MFP4_PA0_PWM0_CH4   0x00000000UL        /*!< ALT_MFP4 PA.0 setting for PWM0_CH4 */

#define SYS_GPA_MFP_PA0_Msk         (1UL<<0)            /*!< GPA_MFP PA.0 mask */
#define SYS_ALT_MFP_PA0_Msk         0UL                 /*!< No ALT_MFP PA.0 mask */
#define SYS_ALT_MFP1_PA0_Msk        0UL                 /*!< No ALT_MFP1 PA.0 mask */
#define SYS_ALT_MFP2_PA0_Msk        0UL                 /*!< No ALT_MFP2 PA.0 mask */
#define SYS_ALT_MFP3_PA0_Msk        (1UL<<4)            /*!< ALT_MFP3 PA.0 mask */
#define SYS_ALT_MFP4_PA0_Msk        ((1UL<<12)|(1UL<<7))/*!< ALT_MFP4 PA.0 mask */

//PA.1
#define SYS_GPA_MFP_PA1_GPIO        0x00000000UL        /*!< GPA_MFP PA.1 setting for GPIO */
#define SYS_ALT_MFP_PA1_GPIO        0UL                 /*!< No ALT_MFP setting for PA.1 */
#define SYS_ALT_MFP1_PA1_GPIO       0UL                 /*!< No ALT_MFP1 setting for PA.1 */
#define SYS_ALT_MFP2_PA1_GPIO       0UL                 /*!< No ALT_MFP2 setting for PA.1 */
#define SYS_ALT_MFP3_PA1_GPIO       0x00000000UL        /*!< ALT_MFP3 PA.1 setting for GPIO */
#define SYS_ALT_MFP4_PA1_GPIO       0x00000000UL        /*!< ALT_MFP4 PA.1 setting for GPIO */

#define SYS_GPA_MFP_PA1_ADC1        (1UL<<1)            /*!< GPA_MFP PA.1 setting for ADC1 */
#define SYS_ALT_MFP_PA1_ADC1        0UL                 /*!< No ALT_MFP setting for PA.1 */
#define SYS_ALT_MFP1_PA1_ADC1       0UL                 /*!< No ALT_MFP1 setting for PA.1 */
#define SYS_ALT_MFP2_PA1_ADC1       0UL                 /*!< No ALT_MFP2 setting for PA.1 */
#define SYS_ALT_MFP3_PA1_ADC1       0x00000000UL        /*!< ALT_MFP3 PA.1 setting for ADC1 */
#define SYS_ALT_MFP4_PA1_ADC1       0x00000000UL        /*!< ALT_MFP4 PA.1 setting for ADC1 */

#define SYS_GPA_MFP_PA1_I2C1_SDA    (1UL<<1)            /*!< GPA_MFP PA.1 setting for I2C1_SDA */
#define SYS_ALT_MFP_PA1_I2C1_SDA    0UL                 /*!< No ALT_MFP setting for PA.1 */
#define SYS_ALT_MFP1_PA1_I2C1_SDA   0UL                 /*!< No ALT_MFP1 setting for PA.1 */
#define SYS_ALT_MFP2_PA1_I2C1_SDA   0UL                 /*!< No ALT_MFP2 setting for PA.1 */
#define SYS_ALT_MFP3_PA1_I2C1_SDA   0x00000000UL        /*!< ALT_MFP3 PA.1 setting for I2C1_SDA */
#define SYS_ALT_MFP4_PA1_I2C1_SDA   (1UL<<13)           /*!< ALT_MFP4 PA.1 setting for I2C1_SDA */

#define SYS_GPA_MFP_PA1_UART5_RXD   (1UL<<1)            /*!< GPA_MFP PA.1 setting for UART5_RXD */
#define SYS_ALT_MFP_PA1_UART5_RXD   0UL                 /*!< No ALT_MFP setting for PA.1 */
#define SYS_ALT_MFP1_PA1_UART5_RXD  0UL                 /*!< No ALT_MFP1 setting for PA.1 */
#define SYS_ALT_MFP2_PA1_UART5_RXD  0UL                 /*!< No ALT_MFP2 setting for PA.1 */
#define SYS_ALT_MFP3_PA1_UART5_RXD  0x00000000UL        /*!< ALT_MFP3 PA.1 setting for UART5_RXD */
#define SYS_ALT_MFP4_PA1_UART5_RXD  (1UL<<6)            /*!< ALT_MFP4 PA.1 setting for UART5_RXD */

#define SYS_GPA_MFP_PA1_PWM0_CH5    (1UL<<1)            /*!< GPA_MFP PA.1 setting for PWM0_CH5 */
#define SYS_ALT_MFP_PA1_PWM0_CH5    0UL                 /*!< No ALT_MFP setting for PA.1 */
#define SYS_ALT_MFP1_PA1_PWM0_CH5   0UL                 /*!< No ALT_MFP1 setting for PA.1 */
#define SYS_ALT_MFP2_PA1_PWM0_CH5   0UL                 /*!< No ALT_MFP2 setting for PA.1 */
#define SYS_ALT_MFP3_PA1_PWM0_CH5   (1UL<<5)            /*!< ALT_MFP3 PA.1 setting for PWM0_CH5 */
#define SYS_ALT_MFP4_PA1_PWM0_CH5   0x00000000UL        /*!< ALT_MFP4 PA.1 setting for PWM0_CH5 */

#define SYS_GPA_MFP_PA1_Msk         (1UL<<1)            /*!< GPA_MFP PA.1 mask */
#define SYS_ALT_MFP_PA1_Msk         0UL                 /*!< No ALT_MFP PA.1 mask */
#define SYS_ALT_MFP1_PA1_Msk        0UL                 /*!< No ALT_MFP1 PA.1 mask */
#define SYS_ALT_MFP2_PA1_Msk        0UL                 /*!< No ALT_MFP2 PA.1 mask */
#define SYS_ALT_MFP3_PA1_Msk        (1UL<<5)            /*!< ALT_MFP3 PA.1 mask */
#define SYS_ALT_MFP4_PA1_Msk        ((1UL<<13)|(1UL<<6))/*!< ALT_MFP4 PA.1 mask */

//PA.2
#define SYS_GPA_MFP_PA2_GPIO        0x00000000UL        /*!< GPA_MFP PA.2 setting for GPIO */
#define SYS_ALT_MFP_PA2_GPIO        0UL                 /*!< No ALT_MFP setting for PA.2 */
#define SYS_ALT_MFP1_PA2_GPIO       0UL                 /*!< No ALT_MFP1 setting for PA.2 */
#define SYS_ALT_MFP2_PA2_GPIO       0UL                 /*!< No ALT_MFP2 setting for PA.2 */
#define SYS_ALT_MFP3_PA2_GPIO       0x00000000UL        /*!< ALT_MFP3 PA.2 setting for GPIO */
#define SYS_ALT_MFP4_PA2_GPIO       0x00000000UL        /*!< ALT_MFP4 PA.2 setting for GPIO */

#define SYS_GPA_MFP_PA2_ADC2        (1UL<<2)            /*!< GPA_MFP PA.2 setting for ADC2 */
#define SYS_ALT_MFP_PA2_ADC2        0UL                 /*!< No ALT_MFP setting for PA.2 */
#define SYS_ALT_MFP1_PA2_ADC2       0UL                 /*!< No ALT_MFP1 setting for PA.2 */
#define SYS_ALT_MFP2_PA2_ADC2       0UL                 /*!< No ALT_MFP2 setting for PA.2 */
#define SYS_ALT_MFP3_PA2_ADC2       0x00000000UL        /*!< ALT_MFP3 PA.2 setting for ADC2 */
#define SYS_ALT_MFP4_PA2_ADC2       0x00000000UL        /*!< ALT_MFP4 PA.2 setting for ADC2 */

