OpenNuvoton/NuTool-PinConfigure/Header/NUC1311/sys.h
#define SYS_GPA_MFP_PA2_UART3_TXD   (1UL<<2)            /*!< GPA_MFP PA.2 setting for UART3_TXD */
#define SYS_ALT_MFP_PA2_UART3_TXD   0UL                 /*!< No ALT_MFP setting for PA.2 */
#define SYS_ALT_MFP1_PA2_UART3_TXD  0UL                 /*!< No ALT_MFP1 setting for PA.2 */
#define SYS_ALT_MFP2_PA2_UART3_TXD  0UL                 /*!< No ALT_MFP2 setting for PA.2 */
#define SYS_ALT_MFP3_PA2_UART3_TXD  0x00000000UL        /*!< ALT_MFP3 PA.2 setting for UART3_TXD */
#define SYS_ALT_MFP4_PA2_UART3_TXD  (1UL<<3)            /*!< ALT_MFP4 PA.2 setting for UART3_TXD */

#define SYS_GPA_MFP_PA2_PWM1_CH0    (1UL<<2)            /*!< GPA_MFP PA.2 setting for PWM1_CH0 */
#define SYS_ALT_MFP_PA2_PWM1_CH0    0UL                 /*!< No ALT_MFP setting for PA.2 */
#define SYS_ALT_MFP1_PA2_PWM1_CH0   0UL                 /*!< No ALT_MFP1 setting for PA.2 */
#define SYS_ALT_MFP2_PA2_PWM1_CH0   0UL                 /*!< No ALT_MFP2 setting for PA.2 */
#define SYS_ALT_MFP3_PA2_PWM1_CH0   (1UL<<6)            /*!< ALT_MFP3 PA.2 setting for PWM1_CH0 */
#define SYS_ALT_MFP4_PA2_PWM1_CH0   0x00000000UL        /*!< ALT_MFP4 PA.2 setting for PWM1_CH0 */

#define SYS_GPA_MFP_PA2_Msk         (1UL<<2)            /*!< GPA_MFP PA.2 mask */
#define SYS_ALT_MFP_PA2_Msk         0UL                 /*!< No ALT_MFP PA.2 mask */
#define SYS_ALT_MFP1_PA2_Msk        0UL                 /*!< No ALT_MFP1 PA.2 mask */
#define SYS_ALT_MFP2_PA2_Msk        0UL                 /*!< No ALT_MFP2 PA.2 mask */
#define SYS_ALT_MFP3_PA2_Msk        (1UL<<6)            /*!< ALT_MFP3 PA.2 mask */
#define SYS_ALT_MFP4_PA2_Msk        (1UL<<3)            /*!< ALT_MFP4 PA.2 mask */

//PA.3
#define SYS_GPA_MFP_PA3_GPIO        0x00000000UL        /*!< GPA_MFP PA.3 setting for GPIO */
#define SYS_ALT_MFP_PA3_GPIO        0UL                 /*!< No ALT_MFP setting for PA.3 */
#define SYS_ALT_MFP1_PA3_GPIO       0UL                 /*!< No ALT_MFP1 setting for PA.3 */
#define SYS_ALT_MFP2_PA3_GPIO       0UL                 /*!< No ALT_MFP2 setting for PA.3 */
#define SYS_ALT_MFP3_PA3_GPIO       0x00000000UL        /*!< ALT_MFP3 PA.3 setting for GPIO */
#define SYS_ALT_MFP4_PA3_GPIO       0x00000000UL        /*!< ALT_MFP4 PA.3 setting for GPIO */

#define SYS_GPA_MFP_PA3_ADC3        (1UL<<3)            /*!< GPA_MFP PA.3 setting for ADC3 */
#define SYS_ALT_MFP_PA3_ADC3        0UL                 /*!< No ALT_MFP setting for PA.3 */
#define SYS_ALT_MFP1_PA3_ADC3       0UL                 /*!< No ALT_MFP1 setting for PA.3 */
#define SYS_ALT_MFP2_PA3_ADC3       0UL                 /*!< No ALT_MFP2 setting for PA.3 */
#define SYS_ALT_MFP3_PA3_ADC3       0x00000000UL        /*!< ALT_MFP3 PA.3 setting for ADC3 */
#define SYS_ALT_MFP4_PA3_ADC3       0x00000000UL        /*!< ALT_MFP4 PA.3 setting for ADC3 */

#define SYS_GPA_MFP_PA3_UART3_RXD   (1UL<<3)            /*!< GPA_MFP PA.3 setting for UART3_RXD */
#define SYS_ALT_MFP_PA3_UART3_RXD   0UL                 /*!< No ALT_MFP setting for PA.3 */
#define SYS_ALT_MFP1_PA3_UART3_RXD  0UL                 /*!< No ALT_MFP1 setting for PA.3 */
#define SYS_ALT_MFP2_PA3_UART3_RXD  0UL                 /*!< No ALT_MFP2 setting for PA.3 */
#define SYS_ALT_MFP3_PA3_UART3_RXD  0x00000000UL        /*!< ALT_MFP3 PA.3 setting for UART3_RXD */
#define SYS_ALT_MFP4_PA3_UART3_RXD  (1UL<<2)            /*!< ALT_MFP4 PA.3 setting for UART3_RXD */

#define SYS_GPA_MFP_PA3_PWM1_CH1    (1UL<<3)            /*!< GPA_MFP PA.3 setting for PWM1_CH1 */
#define SYS_ALT_MFP_PA3_PWM1_CH1    0UL                 /*!< No ALT_MFP setting for PA.3 */
#define SYS_ALT_MFP1_PA3_PWM1_CH1   0UL                 /*!< No ALT_MFP1 setting for PA.3 */
#define SYS_ALT_MFP2_PA3_PWM1_CH1   0UL                 /*!< No ALT_MFP2 setting for PA.3 */
#define SYS_ALT_MFP3_PA3_PWM1_CH1   (1UL<<7)            /*!< ALT_MFP3 PA.3 setting for PWM1_CH1 */
#define SYS_ALT_MFP4_PA3_PWM1_CH1   0x00000000UL        /*!< ALT_MFP4 PA.3 setting for PWM1_CH1 */

#define SYS_GPA_MFP_PA3_Msk         (1UL<<3)            /*!< GPA_MFP PA.3 mask */
#define SYS_ALT_MFP_PA3_Msk         0UL                 /*!< No ALT_MFP PA.3 mask */
#define SYS_ALT_MFP1_PA3_Msk        0UL                 /*!< No ALT_MFP1 PA.3 mask */
#define SYS_ALT_MFP2_PA3_Msk        0UL                 /*!< No ALT_MFP2 PA.3 mask */
#define SYS_ALT_MFP3_PA3_Msk        (1UL<<7)            /*!< ALT_MFP3 PA.3 mask */
#define SYS_ALT_MFP4_PA3_Msk        (1UL<<2)            /*!< ALT_MFP4 PA.3 mask */

//PA.4
#define SYS_GPA_MFP_PA4_GPIO        0x00000000UL        /*!< GPA_MFP PA.4 setting for GPIO */
#define SYS_ALT_MFP_PA4_GPIO        0UL                 /*!< No ALT_MFP setting for PA.4 */
#define SYS_ALT_MFP1_PA4_GPIO       0UL                 /*!< No ALT_MFP1 setting for PA.4 */
#define SYS_ALT_MFP2_PA4_GPIO       0UL                 /*!< No ALT_MFP2 setting for PA.4 */
#define SYS_ALT_MFP3_PA4_GPIO       0UL                 /*!< No ALT_MFP3 setting for PA.4 */
#define SYS_ALT_MFP4_PA4_GPIO       0UL                 /*!< No ALT_MFP4 setting for PA.4 */

#define SYS_GPA_MFP_PA4_ADC4        (1UL<<4)            /*!< GPA_MFP PA.4 setting for ADC4 */
#define SYS_ALT_MFP_PA4_ADC4        0UL                 /*!< No ALT_MFP setting for PA.4 */
#define SYS_ALT_MFP1_PA4_ADC4       0UL                 /*!< No ALT_MFP1 setting for PA.4 */
#define SYS_ALT_MFP2_PA4_ADC4       0UL                 /*!< No ALT_MFP2 setting for PA.4 */
#define SYS_ALT_MFP3_PA4_ADC4       0UL                 /*!< No ALT_MFP3 setting for PA.4 */
#define SYS_ALT_MFP4_PA4_ADC4       0UL                 /*!< No ALT_MFP4 setting for PA.4 */

#define SYS_GPA_MFP_PA4_Msk         (1UL<<4)            /*!< GPA_MFP PA.4 mask */
#define SYS_ALT_MFP_PA4_Msk         0UL                 /*!< No ALT_MFP PA.4 mask */
#define SYS_ALT_MFP1_PA4_Msk        0UL                 /*!< No ALT_MFP1 PA.4 mask */
#define SYS_ALT_MFP2_PA4_Msk        0UL                 /*!< No ALT_MFP2 PA.4 mask */
#define SYS_ALT_MFP3_PA4_Msk        0UL                 /*!< No ALT_MFP3 PA.4 mask */
#define SYS_ALT_MFP4_PA4_Msk        0UL                 /*!< No ALT_MFP4 PA.4 mask */

//PA.5
#define SYS_GPA_MFP_PA5_GPIO        0x00000000UL        /*!< GPA_MFP PA.5 setting for GPIO */
#define SYS_ALT_MFP_PA5_GPIO        0UL                 /*!< No ALT_MFP setting for PA.5 */
#define SYS_ALT_MFP1_PA5_GPIO       0UL                 /*!< No ALT_MFP1 setting for PA.5 */
#define SYS_ALT_MFP2_PA5_GPIO       0UL                 /*!< No ALT_MFP2 setting for PA.5 */
#define SYS_ALT_MFP3_PA5_GPIO       0UL                 /*!< No ALT_MFP3 setting for PA.5 */
#define SYS_ALT_MFP4_PA5_GPIO       0x00000000UL        /*!< ALT_MFP4 PA.5 setting for GPIO */

#define SYS_GPA_MFP_PA5_ADC5        (1UL<<5)            /*!< GPA_MFP PA.5 setting for ADC5 */
#define SYS_ALT_MFP_PA5_ADC5        0UL                 /*!< No ALT_MFP setting for PA.5 */
#define SYS_ALT_MFP1_PA5_ADC5       0UL                 /*!< No ALT_MFP1 setting for PA.5 */
#define SYS_ALT_MFP2_PA5_ADC5       0UL                 /*!< No ALT_MFP2 setting for PA.5 */
#define SYS_ALT_MFP3_PA5_ADC5       0UL                 /*!< No ALT_MFP3 setting for PA.5 */
#define SYS_ALT_MFP4_PA5_ADC5       0x00000000UL        /*!< ALT_MFP4 PA.5 setting for ADC5 */

#define SYS_GPA_MFP_PA5_UART3_RXD   (1UL<<5)            /*!< GPA_MFP PA.5 setting for UART3_RXD */
#define SYS_ALT_MFP_PA5_UART3_RXD   0UL                 /*!< No ALT_MFP setting for PA.5 */
#define SYS_ALT_MFP1_PA5_UART3_RXD  0UL                 /*!< No ALT_MFP1 setting for PA.5 */
#define SYS_ALT_MFP2_PA5_UART3_RXD  0UL                 /*!< No ALT_MFP2 setting for PA.5 */
#define SYS_ALT_MFP3_PA5_UART3_RXD  0UL                 /*!< No ALT_MFP3 setting for PA.5 */
#define SYS_ALT_MFP4_PA5_UART3_RXD  (1UL<<4)            /*!< ALT_MFP4 PA.5 setting for UART3_RXD */

#define SYS_GPA_MFP_PA5_Msk         (1UL<<5)            /*!< GPA_MFP PA.5 mask */
#define SYS_ALT_MFP_PA5_Msk         0UL                 /*!< No ALT_MFP PA.5 mask */
#define SYS_ALT_MFP1_PA5_Msk        0UL                 /*!< No ALT_MFP1 PA.5 mask */
#define SYS_ALT_MFP2_PA5_Msk        0UL                 /*!< No ALT_MFP2 PA.5 mask */
#define SYS_ALT_MFP3_PA5_Msk        0UL                 /*!< No ALT_MFP3 PA.5 mask */
#define SYS_ALT_MFP4_PA5_Msk        (1UL<<4)            /*!< ALT_MFP4 PA.5 mask */

//PA.6
#define SYS_GPA_MFP_PA6_GPIO        0x00000000UL        /*!< GPA_MFP PA.6 setting for GPIO */
#define SYS_ALT_MFP_PA6_GPIO        0UL                 /*!< No ALT_MFP setting for PA.6 */
#define SYS_ALT_MFP1_PA6_GPIO       0UL                 /*!< No ALT_MFP1 setting for PA.6 */
#define SYS_ALT_MFP2_PA6_GPIO       0UL                 /*!< No ALT_MFP2 setting for PA.6 */
#define SYS_ALT_MFP3_PA6_GPIO       0UL                 /*!< No ALT_MFP3 setting for PA.6 */
#define SYS_ALT_MFP4_PA6_GPIO       0x00000000UL        /*!< ALT_MFP4 PA.6 setting for GPIO */

#define SYS_GPA_MFP_PA6_ADC6        (1UL<<6)            /*!< GPA_MFP PA.6 setting for ADC6 */
#define SYS_ALT_MFP_PA6_ADC6        0UL                 /*!< No ALT_MFP setting for PA.6 */
#define SYS_ALT_MFP1_PA6_ADC6       0UL                 /*!< No ALT_MFP1 setting for PA.6 */
#define SYS_ALT_MFP2_PA6_ADC6       0UL                 /*!< No ALT_MFP2 setting for PA.6 */
#define SYS_ALT_MFP3_PA6_ADC6       0UL                 /*!< No ALT_MFP3 setting for PA.6 */
#define SYS_ALT_MFP4_PA6_ADC6       0x00000000UL        /*!< ALT_MFP4 PA.6 setting for ADC6 */

#define SYS_GPA_MFP_PA6_UART3_TXD   (1UL<<6)            /*!< GPA_MFP PA.6 setting for UART3_TXD */
#define SYS_ALT_MFP_PA6_UART3_TXD   0UL                 /*!< No ALT_MFP setting for PA.6 */
#define SYS_ALT_MFP1_PA6_UART3_TXD  0UL                 /*!< No ALT_MFP1 setting for PA.6 */
#define SYS_ALT_MFP2_PA6_UART3_TXD  0UL                 /*!< No ALT_MFP2 setting for PA.6 */
#define SYS_ALT_MFP3_PA6_UART3_TXD  0UL                 /*!< No ALT_MFP3 setting for PA.6 */
#define SYS_ALT_MFP4_PA6_UART3_TXD  (1UL<<5)            /*!< ALT_MFP4 PA.6 setting for UART3_TXD */

