OpenNuvoton/NuTool-PinConfigure/Header/NUC1311/sys.h
#define SYS_GPA_MFP_PA6_Msk         (1UL<<6)            /*!< GPA_MFP PA.6 mask */
#define SYS_ALT_MFP_PA6_Msk         0UL                 /*!< No ALT_MFP PA.6 mask */
#define SYS_ALT_MFP1_PA6_Msk        0UL                 /*!< No ALT_MFP1 PA.6 mask */
#define SYS_ALT_MFP2_PA6_Msk        0UL                 /*!< No ALT_MFP2 PA.6 mask */
#define SYS_ALT_MFP3_PA6_Msk        0UL                 /*!< No ALT_MFP3 PA.6 mask */
#define SYS_ALT_MFP4_PA6_Msk        (1UL<<5)            /*!< ALT_MFP4 PA.6 mask */

//PA.7
#define SYS_GPA_MFP_PA7_GPIO        0x00000000UL        /*!< GPA_MFP PA.7 setting for GPIO */
#define SYS_ALT_MFP_PA7_GPIO        0UL                 /*!< No ALT_MFP setting for PA.7 */
#define SYS_ALT_MFP1_PA7_GPIO       0UL                 /*!< No ALT_MFP1 setting for PA.7 */
#define SYS_ALT_MFP2_PA7_GPIO       0UL                 /*!< No ALT_MFP2 setting for PA.7 */
#define SYS_ALT_MFP3_PA7_GPIO       0UL                 /*!< No ALT_MFP3 setting for PA.7 */
#define SYS_ALT_MFP4_PA7_GPIO       0x00000000UL        /*!< ALT_MFP4 PA.7 setting for GPIO */

#define SYS_GPA_MFP_PA7_ADC7        (1UL<<7)            /*!< GPA_MFP PA.7 setting for ADC7 */
#define SYS_ALT_MFP_PA7_ADC7        0UL                 /*!< No ALT_MFP setting for PA.7 */
#define SYS_ALT_MFP1_PA7_ADC7       0UL                 /*!< No ALT_MFP1 setting for PA.7 */
#define SYS_ALT_MFP2_PA7_ADC7       0UL                 /*!< No ALT_MFP2 setting for PA.7 */
#define SYS_ALT_MFP3_PA7_ADC7       0UL                 /*!< No ALT_MFP3 setting for PA.7 */
#define SYS_ALT_MFP4_PA7_ADC7       0x00000000UL        /*!< ALT_MFP4 PA.7 setting for ADC7 */

#define SYS_GPA_MFP_PA7_Vref        (1UL<<7)            /*!< GPA_MFP PA.7 setting for Vref */
#define SYS_ALT_MFP_PA7_Vref        0UL                 /*!< No ALT_MFP setting for PA.7 */
#define SYS_ALT_MFP1_PA7_Vref       0UL                 /*!< No ALT_MFP1 setting for PA.7 */
#define SYS_ALT_MFP2_PA7_Vref       0UL                 /*!< No ALT_MFP2 setting for PA.7 */
#define SYS_ALT_MFP3_PA7_Vref       0UL                 /*!< No ALT_MFP3 setting for PA.7 */
#define SYS_ALT_MFP4_PA7_Vref       (1UL<<14)           /*!< ALT_MFP4 PA.7 setting for Vref */

#define SYS_GPA_MFP_PA7_Msk         (1UL<<7)            /*!< GPA_MFP PA.7 mask */
#define SYS_ALT_MFP_PA7_Msk         0UL                 /*!< No ALT_MFP PA.7 mask */
#define SYS_ALT_MFP1_PA7_Msk        0UL                 /*!< No ALT_MFP1 PA.7 mask */
#define SYS_ALT_MFP2_PA7_Msk        0UL                 /*!< No ALT_MFP2 PA.7 mask */
#define SYS_ALT_MFP3_PA7_Msk        0UL                 /*!< No ALT_MFP3 PA.7 mask */
#define SYS_ALT_MFP4_PA7_Msk        (1UL<<14)            /*!< ALT_MFP4 PA.7 mask */

//PA.8
#define SYS_GPA_MFP_PA8_GPIO        0x00000000UL        /*!< GPA_MFP PA.8 setting for GPIO */
#define SYS_ALT_MFP_PA8_GPIO        0UL                 /*!< No ALT_MFP setting for PA.8 */
#define SYS_ALT_MFP1_PA8_GPIO       0UL                 /*!< No ALT_MFP1 setting for PA.8 */
#define SYS_ALT_MFP2_PA8_GPIO       0UL                 /*!< No ALT_MFP2 setting for PA.8 */
#define SYS_ALT_MFP3_PA8_GPIO       0UL                 /*!< No ALT_MFP3 setting for PA.8 */
#define SYS_ALT_MFP4_PA8_GPIO       0x00000000UL        /*!< ALT_MFP4 PA.8 setting for GPIO */

#define SYS_GPA_MFP_PA8_I2C0_SDA     (1UL<<8)           /*!< GPA_MFP PA.8 setting for I2C0_SDA */
#define SYS_ALT_MFP_PA8_I2C0_SDA    0UL                 /*!< No ALT_MFP setting for PA.8 */
#define SYS_ALT_MFP1_PA8_I2C0_SDA   0UL                 /*!< No ALT_MFP1 setting for PA.8 */
#define SYS_ALT_MFP2_PA8_I2C0_SDA   0UL                 /*!< No ALT_MFP2 setting for PA.8 */
#define SYS_ALT_MFP3_PA8_I2C0_SDA   0UL                 /*!< No ALT_MFP3 setting for PA.8 */
#define SYS_ALT_MFP4_PA8_I2C0_SDA   0x00000000UL        /*!< ALT_MFP4 PA.8 setting for I2C0_SDA */

#define SYS_GPA_MFP_PA8_UART1_nRTS   (1UL<<8)           /*!< GPA_MFP PA.8 setting for UART1_nRTS */
#define SYS_ALT_MFP_PA8_UART1_nRTS   0UL                /*!< No ALT_MFP setting for PA.8 */
#define SYS_ALT_MFP1_PA8_UART1_nRTS  0UL                /*!< No ALT_MFP1 setting for PA.8 */
#define SYS_ALT_MFP2_PA8_UART1_nRTS  0UL                /*!< No ALT_MFP2 setting for PA.8 */
#define SYS_ALT_MFP3_PA8_UART1_nRTS  0UL                /*!< No ALT_MFP3 setting for PA.8 */
#define SYS_ALT_MFP4_PA8_UART1_nRTS  (1UL<<0)           /*!< ALT_MFP4 PA.8 setting for UART1_nRTS */

#define SYS_GPA_MFP_PA8_Msk         (1UL<<8)            /*!< GPA_MFP PA.8 mask */
#define SYS_ALT_MFP_PA8_Msk         0UL                 /*!< No ALT_MFP PA.8 mask */
#define SYS_ALT_MFP1_PA8_Msk        0UL                 /*!< No ALT_MFP1 PA.8 mask */
#define SYS_ALT_MFP2_PA8_Msk        0UL                 /*!< No ALT_MFP2 PA.8 mask */
#define SYS_ALT_MFP3_PA8_Msk        0UL                 /*!< No ALT_MFP3 PA.8 mask */
#define SYS_ALT_MFP4_PA8_Msk        (1UL<<0)            /*!< ALT_MFP4 PA.8 mask */

//PA.9
#define SYS_GPA_MFP_PA9_GPIO        0x00000000UL        /*!< GPA_MFP PA.9 setting for GPIO */
#define SYS_ALT_MFP_PA9_GPIO        0UL                 /*!< No ALT_MFP setting for PA.9 */
#define SYS_ALT_MFP1_PA9_GPIO       0UL                 /*!< No ALT_MFP1 setting for PA.9 */
#define SYS_ALT_MFP2_PA9_GPIO       0UL                 /*!< No ALT_MFP2 setting for PA.9 */
#define SYS_ALT_MFP3_PA9_GPIO       0UL                 /*!< No ALT_MFP3 setting for PA.9 */
#define SYS_ALT_MFP4_PA9_GPIO       0x00000000UL        /*!< ALT_MFP4 PA.9 setting for GPIO */

#define SYS_GPA_MFP_PA9_I2C0_SCL    (1UL<<9)            /*!< GPA_MFP PA.9 setting for I2C0_SCL */
#define SYS_ALT_MFP_PA9_I2C0_SCL    0UL                 /*!< No ALT_MFP setting for PA.9 */
#define SYS_ALT_MFP1_PA9_I2C0_SCL   0UL                 /*!< No ALT_MFP1 setting for PA.9 */
#define SYS_ALT_MFP2_PA9_I2C0_SCL   0UL                 /*!< No ALT_MFP2 setting for PA.9 */
#define SYS_ALT_MFP3_PA9_I2C0_SCL   0UL                 /*!< No ALT_MFP3 setting for PA.9 */
#define SYS_ALT_MFP4_PA9_I2C0_SCL   0x00000000UL        /*!< ALT_MFP4 PA.9 setting for I2C0_SCL */

#define SYS_GPA_MFP_PA9_UART1_nCTS   (1UL<<9)           /*!< GPA_MFP PA.9 setting for UART1_nCTS */
#define SYS_ALT_MFP_PA9_UART1_nCTS   0UL                /*!< No ALT_MFP setting for PA.9 */
#define SYS_ALT_MFP1_PA9_UART1_nCTS  0UL                /*!< No ALT_MFP1 setting for PA.9 */
#define SYS_ALT_MFP2_PA9_UART1_nCTS  0UL                /*!< No ALT_MFP2 setting for PA.9 */
#define SYS_ALT_MFP3_PA9_UART1_nCTS  0UL                /*!< No ALT_MFP3 setting for PA.9 */
#define SYS_ALT_MFP4_PA9_UART1_nCTS  (1UL<<1)           /*!< ALT_MFP4 PA.9 setting for UART1_nCTS */

#define SYS_GPA_MFP_PA9_Msk          (1UL<<9)           /*!< GPA_MFP PA.9 mask */
#define SYS_ALT_MFP_PA9_Msk          0UL                /*!< No ALT_MFP PA.9 mask */
#define SYS_ALT_MFP1_PA9_Msk         0UL                /*!< No ALT_MFP1 PA.9 mask */
#define SYS_ALT_MFP2_PA9_Msk         0UL                /*!< No ALT_MFP2 PA.9 mask */
#define SYS_ALT_MFP3_PA9_Msk         0UL                /*!< No ALT_MFP3 PA.9 mask */
#define SYS_ALT_MFP4_PA9_Msk         (1UL<<1)           /*!< ALT_MFP4 PA.9 mask */

//PA.10
#define SYS_GPA_MFP_PA10_GPIO        0x00000000UL       /*!< GPA_MFP PA.10 setting for GPIO */
#define SYS_ALT_MFP_PA10_GPIO        0UL                /*!< No ALT_MFP setting for PA.10 */
#define SYS_ALT_MFP1_PA10_GPIO       0UL                /*!< No ALT_MFP1 setting for PA.10 */
#define SYS_ALT_MFP2_PA10_GPIO       0UL                /*!< No ALT_MFP2 setting for PA.10 */
#define SYS_ALT_MFP3_PA10_GPIO       0x00000000UL       /*!< ALT_MFP3 PA.10 setting for GPIO */
#define SYS_ALT_MFP4_PA10_GPIO       0UL                /*!< No ALT_MFP4 setting for PA.10 */

#define SYS_GPA_MFP_PA10_I2C1_SDA    (1UL<<10)          /*!< GPA_MFP PA.10 setting for I2C1_SDA */
#define SYS_ALT_MFP_PA10_I2C1_SDA    0UL                /*!< No ALT_MFP setting for PA.10 */
#define SYS_ALT_MFP1_PA10_I2C1_SDA   0UL                /*!< No ALT_MFP1 setting for PA.10 */
#define SYS_ALT_MFP2_PA10_I2C1_SDA   0UL                /*!< No ALT_MFP2 setting for PA.10 */
#define SYS_ALT_MFP3_PA10_I2C1_SDA   0x00000000UL       /*!< ALT_MFP3 PA.10 setting for I2C1_SDA */
#define SYS_ALT_MFP4_PA10_I2C1_SDA   0UL                /*!< No ALT_MFP4 setting for PA.10 */

#define SYS_GPA_MFP_PA10_PWM1_CH2    (1UL<<10)          /*!< GPA_MFP PA.10 setting for PWM1_CH2 */
#define SYS_ALT_MFP_PA10_PWM1_CH2    0UL                /*!< No ALT_MFP setting for PA.10 */
#define SYS_ALT_MFP1_PA10_PWM1_CH2   0UL                /*!< No ALT_MFP1 setting for PA.10 */
#define SYS_ALT_MFP2_PA10_PWM1_CH2   0UL                /*!< No ALT_MFP2 setting for PA.10 */
#define SYS_ALT_MFP3_PA10_PWM1_CH2   (1UL<<8)           /*!< ALT_MFP3 PA.10 setting for PWM1_CH2 */
#define SYS_ALT_MFP4_PA10_PWM1_CH2   0UL                /*!< No ALT_MFP4 setting for PA.10 */

#define SYS_GPA_MFP_PA10_Msk         (1UL<<10)          /*!< GPA_MFP PA.10 mask */
#define SYS_ALT_MFP_PA10_Msk         0UL                /*!< No ALT_MFP PA.10 mask */
#define SYS_ALT_MFP1_PA10_Msk        0UL                /*!< No ALT_MFP1 PA.10 mask */
#define SYS_ALT_MFP2_PA10_Msk        0UL                /*!< No ALT_MFP2 PA.10 mask */
#define SYS_ALT_MFP3_PA10_Msk        (1UL<<8)           /*!< ALT_MFP3 PA.10 mask */
#define SYS_ALT_MFP4_PA10_Msk        0UL                /*!< No ALT_MFP4 PA.10 mask */

//PA.11
#define SYS_GPA_MFP_PA11_GPIO        0x00000000UL       /*!< GPA_MFP PA.11 setting for GPIO */
#define SYS_ALT_MFP_PA11_GPIO        0UL                /*!< No ALT_MFP setting for PA.11 */
#define SYS_ALT_MFP1_PA11_GPIO       0UL                /*!< No ALT_MFP1 setting for PA.11 */
#define SYS_ALT_MFP2_PA11_GPIO       0UL                /*!< No ALT_MFP2 setting for PA.11 */
#define SYS_ALT_MFP3_PA11_GPIO       0x00000000UL       /*!< ALT_MFP3 PA.11 setting for GPIO */
#define SYS_ALT_MFP4_PA11_GPIO       0UL                /*!< No ALT_MFP4 setting for PA.11 */

#define SYS_GPA_MFP_PA11_I2C1_SCL    (1UL<<11)          /*!< GPA_MFP PA.11 setting for I2C1_SCL */
#define SYS_ALT_MFP_PA11_I2C1_SCL    0UL                /*!< No ALT_MFP setting for PA.11 */
#define SYS_ALT_MFP1_PA11_I2C1_SCL   0UL                /*!< No ALT_MFP1 setting for PA.11 */
#define SYS_ALT_MFP2_PA11_I2C1_SCL   0UL                /*!< No ALT_MFP2 setting for PA.11 */
#define SYS_ALT_MFP3_PA11_I2C1_SCL   0x00000000UL       /*!< ALT_MFP3 PA.11 setting for I2C1_SCL */
#define SYS_ALT_MFP4_PA11_I2C1_SCL   0UL                /*!< No ALT_MFP4 setting for PA.11 */

#define SYS_GPA_MFP_PA11_PWM1_CH3    (1UL<<11)          /*!< GPA_MFP PA.11 setting for PWM1_CH3 */
#define SYS_ALT_MFP_PA11_PWM1_CH3    0UL                /*!< No ALT_MFP setting for PA.11 */
#define SYS_ALT_MFP1_PA11_PWM1_CH3   0UL                /*!< No ALT_MFP1 setting for PA.11 */
#define SYS_ALT_MFP2_PA11_PWM1_CH3   0UL                /*!< No ALT_MFP2 setting for PA.11 */
#define SYS_ALT_MFP3_PA11_PWM1_CH3   (1UL<<9)           /*!< ALT_MFP3 PA.11 setting for PWM1_CH3 */
#define SYS_ALT_MFP4_PA11_PWM1_CH3   0UL                /*!< No ALT_MFP4 setting for PA.11 */

#define SYS_GPA_MFP_PA11_Msk         (1UL<<11)          /*!< GPA_MFP PA.11 mask */
#define SYS_ALT_MFP_PA11_Msk         0UL                /*!< No ALT_MFP PA.11 mask */
#define SYS_ALT_MFP1_PA11_Msk        0UL                /*!< No ALT_MFP1 PA.11 mask */
#define SYS_ALT_MFP2_PA11_Msk        0UL                /*!< No ALT_MFP2 PA.11 mask */
#define SYS_ALT_MFP3_PA11_Msk        (1UL<<9)           /*!< ALT_MFP3 PA.11 mask */
#define SYS_ALT_MFP4_PA11_Msk        0UL                /*!< No ALT_MFP4 PA.11 mask */

//PA.12
#define SYS_GPA_MFP_PA12_GPIO        0x00000000UL       /*!< GPA_MFP PA.12 setting for GPIO */
#define SYS_ALT_MFP_PA12_GPIO        0UL                /*!< No ALT_MFP setting for PA.12 */
#define SYS_ALT_MFP1_PA12_GPIO       0UL                /*!< No ALT_MFP1 setting for PA.12 */
#define SYS_ALT_MFP2_PA12_GPIO       0UL                /*!< No ALT_MFP2 setting for PA.12 */
#define SYS_ALT_MFP3_PA12_GPIO       0UL                /*!< No ALT_MFP3 setting for PA.12 */
#define SYS_ALT_MFP4_PA12_GPIO       0x00000000UL       /*!< ALT_MFP4 PA.12 setting for for GPIO */

