OpenNuvoton/NuTool-PinConfigure/Header/NUC1311/sys.h
#define SYS_GPA_MFP_PA12_PWM0_CH0    (1UL<<12)          /*!< GPA_MFP PA.12 setting for PWM0_CH0 */
#define SYS_ALT_MFP_PA12_PWM0_CH0    0UL                /*!< No ALT_MFP setting for PA.12 */
#define SYS_ALT_MFP1_PA12_PWM0_CH0   0UL                /*!< No ALT_MFP1 setting for PA.12 */
#define SYS_ALT_MFP2_PA12_PWM0_CH0   0UL                /*!< No ALT_MFP2 setting for PA.12 */
#define SYS_ALT_MFP3_PA12_PWM0_CH0   0UL                /*!< No ALT_MFP3 setting for PA.12 */
#define SYS_ALT_MFP4_PA12_PWM0_CH0   0x00000000UL       /*!< ALT_MFP4 PA.12 setting for PWM0_CH0 */

#define SYS_GPA_MFP_PA12_UART5_RXD   (1UL<<12)          /*!< GPA_MFP PA.12 setting for UART5_RXD */
#define SYS_ALT_MFP_PA12_UART5_RXD   0UL                /*!< No ALT_MFP setting for PA.12 */
#define SYS_ALT_MFP1_PA12_UART5_RXD  0UL                /*!< No ALT_MFP1 setting for PA.12 */
#define SYS_ALT_MFP2_PA12_UART5_RXD  0UL                /*!< No ALT_MFP2 setting for PA.12 */
#define SYS_ALT_MFP3_PA12_UART5_RXD  0UL                /*!< No ALT_MFP3 setting for PA.12 */
#define SYS_ALT_MFP4_PA12_UART5_RXD  (1UL<<8)           /*!< ALT_MFP4 PA.12 setting for  UART5_RXD */

#define SYS_GPA_MFP_PA12_Msk         (1UL<<12)          /*!< GPA_MFP PA.12 mask */
#define SYS_ALT_MFP_PA12_Msk         0UL                /*!< No ALT_MFP PA.12 mask */
#define SYS_ALT_MFP1_PA12_Msk        0UL                /*!< No ALT_MFP1 PA.12 mask */
#define SYS_ALT_MFP2_PA12_Msk        0UL                /*!< No ALT_MFP2 PA.12 mask */
#define SYS_ALT_MFP3_PA12_Msk        0UL                /*!< No ALT_MFP3 PA.12 mask */
#define SYS_ALT_MFP4_PA12_Msk        (1UL<<8)           /*!< ALT_MFP4 PA.12 mask */

//PA.13
#define SYS_GPA_MFP_PA13_GPIO        0x00000000UL       /*!< GPA_MFP PA.13 setting for GPIO */
#define SYS_ALT_MFP_PA13_GPIO        0UL                /*!< No ALT_MFP setting for PA.13 */
#define SYS_ALT_MFP1_PA13_GPIO       0UL                /*!< No ALT_MFP1 setting for PA.13 */
#define SYS_ALT_MFP2_PA13_GPIO       0UL                /*!< No ALT_MFP2 setting for PA.13 */
#define SYS_ALT_MFP3_PA13_GPIO       0UL                /*!< No ALT_MFP3 setting for PA.13 */
#define SYS_ALT_MFP4_PA13_GPIO       0x00000000UL       /*!< ALT_MFP4 PA.13 setting for for GPIO */

#define SYS_GPA_MFP_PA13_PWM0_CH1    (1UL<<13)          /*!< GPA_MFP PA.13 setting for PWM0_CH1 */
#define SYS_ALT_MFP_PA13_PWM0_CH1    0UL                /*!< No ALT_MFP setting for PA.13 */
#define SYS_ALT_MFP1_PA13_PWM0_CH1   0UL                /*!< No ALT_MFP1 setting for PA.13 */
#define SYS_ALT_MFP2_PA13_PWM0_CH1   0UL                /*!< No ALT_MFP2 setting for PA.13 */
#define SYS_ALT_MFP3_PA13_PWM0_CH1   0UL                /*!< No ALT_MFP3 setting for PA.13 */
#define SYS_ALT_MFP4_PA13_PWM0_CH1   0x00000000UL       /*!< ALT_MFP4 PA.13 setting for PWM0_CH1 */

#define SYS_GPA_MFP_PA13_UART5_TXD   (1UL<<13)          /*!< GPA_MFP PA.13 setting for UART5_TXD */
#define SYS_ALT_MFP_PA13_UART5_TXD   0UL                /*!< No ALT_MFP setting for PA.13 */
#define SYS_ALT_MFP1_PA13_UART5_TXD  0UL                /*!< No ALT_MFP1 setting for PA.13 */
#define SYS_ALT_MFP2_PA13_UART5_TXD  0UL                /*!< No ALT_MFP2 setting for PA.13 */
#define SYS_ALT_MFP3_PA13_UART5_TXD  0UL                /*!< No ALT_MFP3 setting for PA.13 */
#define SYS_ALT_MFP4_PA13_UART5_TXD  (1UL<<9)           /*!< ALT_MFP4 PA.13 setting for UART5_TXD */

#define SYS_GPA_MFP_PA13_Msk         (1UL<<13)          /*!< GPA_MFP PA.13 mask */
#define SYS_ALT_MFP_PA13_Msk         0UL                /*!< No ALT_MFP PA.13 mask */
#define SYS_ALT_MFP1_PA13_Msk        0UL                /*!< No ALT_MFP1 PA.13 mask */
#define SYS_ALT_MFP2_PA13_Msk        0UL                /*!< No ALT_MFP2 PA.13 mask */
#define SYS_ALT_MFP3_PA13_Msk        0UL                /*!< No ALT_MFP3 PA.13 mask */
#define SYS_ALT_MFP4_PA13_Msk        (1UL<<9)           /*!< ALT_MFP4 PA.13 mask */

//PA.14
#define SYS_GPA_MFP_PA14_GPIO        0x00000000UL       /*!< GPA_MFP PA.14 setting for GPIO */
#define SYS_ALT_MFP_PA14_GPIO        0UL                /*!< No ALT_MFP setting for PA.14 */
#define SYS_ALT_MFP1_PA14_GPIO       0UL                /*!< No ALT_MFP1 setting for PA.14 */
#define SYS_ALT_MFP2_PA14_GPIO       0UL                /*!< No ALT_MFP2 setting for PA.14 */
#define SYS_ALT_MFP3_PA14_GPIO       0UL                /*!< No ALT_MFP3 setting for PA.14 */
#define SYS_ALT_MFP4_PA14_GPIO       0UL                /*!< No ALT_MFP4 setting for PA.14 */

#define SYS_GPA_MFP_PA14_PWM0_CH2    (1UL<<14)          /*!< GPA_MFP PA.14 setting for PWM0_CH2 */
#define SYS_ALT_MFP_PA14_PWM0_CH2    0UL                /*!< No ALT_MFP setting for PA.14 */
#define SYS_ALT_MFP1_PA14_PWM0_CH2   0UL                /*!< No ALT_MFP1 setting for PA.14 */
#define SYS_ALT_MFP2_PA14_PWM0_CH2   0UL                /*!< No ALT_MFP2 setting for PA.14 */
#define SYS_ALT_MFP3_PA14_PWM0_CH2   0UL                /*!< No ALT_MFP3 setting for PA.14 */
#define SYS_ALT_MFP4_PA14_PWM0_CH2   0UL                /*!< No ALT_MFP4 setting for PA.14 */

#define SYS_GPA_MFP_PA14_Msk         (1UL<<14)          /*!< GPA_MFP PA.14 mask */
#define SYS_ALT_MFP_PA14_Msk         0UL                /*!< No ALT_MFP PA.14 mask */
#define SYS_ALT_MFP1_PA14_Msk        0UL                /*!< No ALT_MFP1 PA.14 mask */
#define SYS_ALT_MFP2_PA14_Msk        0UL                /*!< No ALT_MFP2 PA.14 mask */
#define SYS_ALT_MFP3_PA14_Msk        0UL                /*!< No ALT_MFP3 PA.14 mask */
#define SYS_ALT_MFP4_PA14_Msk        0UL                /*!< No ALT_MFP4 PA.14 mask */

//PA.15
#define SYS_GPA_MFP_PA15_GPIO        0x00000000UL       /*!< GPA_MFP PA.15 setting for GPIO */
#define SYS_ALT_MFP_PA15_GPIO        0UL                /*!< No ALT_MFP setting for PA.15 */
#define SYS_ALT_MFP1_PA15_GPIO       0UL                /*!< No ALT_MFP1 setting for PA.15 */
#define SYS_ALT_MFP2_PA15_GPIO       0UL                /*!< No ALT_MFP2 setting for PA.15 */
#define SYS_ALT_MFP3_PA15_GPIO       0UL                /*!< No ALT_MFP3 setting for PA.15 */
#define SYS_ALT_MFP4_PA15_GPIO       0UL                /*!< No ALT_MFP4 setting for PA.15 */

#define SYS_GPA_MFP_PA15_PWM0_CH3    (1UL<<15)          /*!< GPA_MFP PA.15 setting for PWM0_CH3 */
#define SYS_ALT_MFP_PA15_PWM0_CH3    0UL                /*!< No ALT_MFP setting for PA.15 */
#define SYS_ALT_MFP1_PA15_PWM0_CH3   0UL                /*!< No ALT_MFP1 setting for PA.15 */
#define SYS_ALT_MFP2_PA15_PWM0_CH3   0UL                /*!< No ALT_MFP2 setting for PA.15 */
#define SYS_ALT_MFP3_PA15_PWM0_CH3   0UL                /*!< No ALT_MFP3 setting for PA.15 */
#define SYS_ALT_MFP4_PA15_PWM0_CH3   0UL                /*!< No ALT_MFP4 setting for PA.15 */

#define SYS_GPA_MFP_PA15_Msk         (1UL<<15)          /*!< GPA_MFP PA.14 mask */
#define SYS_ALT_MFP_PA15_Msk         0UL                /*!< No ALT_MFP PA.14 mask */
#define SYS_ALT_MFP1_PA15_Msk        0UL                /*!< No ALT_MFP1 PA.14 mask */
#define SYS_ALT_MFP2_PA15_Msk        0UL                /*!< No ALT_MFP2 PA.14 mask */
#define SYS_ALT_MFP3_PA15_Msk        0UL                /*!< No ALT_MFP3 PA.14 mask */
#define SYS_ALT_MFP4_PA15_Msk        0UL                /*!< No ALT_MFP4 PA.14 mask */

//PB.0
#define SYS_GPB_MFP_PB0_GPIO         0x00000000UL       /*!< GPB_MFP PB.0 setting for GPIO */
#define SYS_ALT_MFP_PB0_GPIO         0UL                /*!< No ALT_MFP setting for PB.0 */
#define SYS_ALT_MFP1_PB0_GPIO        0UL                /*!< No ALT_MFP1 setting for PB.0 */
#define SYS_ALT_MFP2_PB0_GPIO        0UL                /*!< No ALT_MFP2 setting for PB.0 */
#define SYS_ALT_MFP3_PB0_GPIO        0UL                /*!< No ALT_MFP3 setting for PB.0 */
#define SYS_ALT_MFP4_PB0_GPIO        0UL                /*!< No ALT_MFP4 setting for PB.0 */

#define SYS_GPB_MFP_PB0_UART0_RXD    (1UL<<0)           /*!< GPB_MFP PB.0 setting for UART0_RXD */
#define SYS_ALT_MFP_PB0_UART0_RXD    0UL                /*!< No ALT_MFP setting for PB.0 */
#define SYS_ALT_MFP1_PB0_UART0_RXD   0UL                /*!< No ALT_MFP1 setting for PB.0 */
#define SYS_ALT_MFP2_PB0_UART0_RXD   0UL                /*!< No ALT_MFP2 setting for PB.0 */
#define SYS_ALT_MFP3_PB0_UART0_RXD   0UL                /*!< No ALT_MFP3 setting for PB.0 */
#define SYS_ALT_MFP4_PB0_UART0_RXD   0UL                /*!< No ALT_MFP4 setting for PB.0 */

