OpenNuvoton/NuTool-PinConfigure/Header/NUC1311/sys.h
//PB.4
#define SYS_GPB_MFP_PB4_GPIO        0x00000000UL        /*!< GPB_MFP PB.4 setting for GPIO */
#define SYS_ALT_MFP_PB4_GPIO        0UL                 /*!< No ALT_MFP setting for PB.4 */
#define SYS_ALT_MFP1_PB4_GPIO       0UL                 /*!< No ALT_MFP1 setting for PB.4 */
#define SYS_ALT_MFP2_PB4_GPIO       0UL                 /*!< No ALT_MFP2 setting for PB.4 */
#define SYS_ALT_MFP3_PB4_GPIO       0UL                 /*!< No ALT_MFP3 setting for PB.4 */
#define SYS_ALT_MFP4_PB4_GPIO       0UL                 /*!< No ALT_MFP4 setting for PB.4 */

#define SYS_GPB_MFP_PB4_UART1_RXD   (1UL<<4)            /*!< GPB_MFP PB.4 setting for UART1_RXD */
#define SYS_ALT_MFP_PB4_UART1_RXD   0UL                 /*!< No ALT_MFP setting for PB.4 */
#define SYS_ALT_MFP1_PB4_UART1_RXD  0UL                 /*!< No ALT_MFP1 setting for PB.4 */
#define SYS_ALT_MFP2_PB4_UART1_RXD  0UL                 /*!< No ALT_MFP2 setting for PB.4 */
#define SYS_ALT_MFP3_PB4_UART1_RXD  0UL                 /*!< No ALT_MFP3 setting for PB.4 */
#define SYS_ALT_MFP4_PB4_UART1_RXD  0UL                 /*!< No ALT_MFP4 setting for PB.4 */

#define SYS_GPB_MFP_PB4_Msk         (1UL<<4)            /*!< GPB_MFP PB.4 mask */
#define SYS_ALT_MFP_PB4_Msk         0UL                 /*!< No ALT_MFP PB.4 mask */
#define SYS_ALT_MFP1_PB4_Msk        0UL                 /*!< No ALT_MFP1 PB.4 mask */
#define SYS_ALT_MFP2_PB4_Msk        0UL                 /*!< No ALT_MFP2 PB.4 mask */
#define SYS_ALT_MFP3_PB4_Msk        0UL                 /*!< No ALT_MFP3 PB.4 mask */
#define SYS_ALT_MFP4_PB4_Msk        0UL                 /*!< No ALT_MFP4 PB.4 mask */

//PB.5
#define SYS_GPB_MFP_PB5_GPIO        0x00000000UL        /*!< GPB_MFP PB.5 setting for GPIO */
#define SYS_ALT_MFP_PB5_GPIO        0UL                 /*!< No ALT_MFP setting for PB.5 */
#define SYS_ALT_MFP1_PB5_GPIO       0UL                 /*!< No ALT_MFP1 setting for PB.5 */
#define SYS_ALT_MFP2_PB5_GPIO       0UL                 /*!< No ALT_MFP2 setting for PB.5 */
#define SYS_ALT_MFP3_PB5_GPIO       0UL                 /*!< No ALT_MFP3 setting for PB.5 */
#define SYS_ALT_MFP4_PB5_GPIO       0UL                 /*!< No ALT_MFP4 setting for PB.5 */

#define SYS_GPB_MFP_PB5_UART1_TXD   (1UL<<5)            /*!< GPB_MFP PB.5 setting for UART1_TXD */
#define SYS_ALT_MFP_PB5_UART1_TXD   0UL                 /*!< No ALT_MFP setting for PB.5 */
#define SYS_ALT_MFP1_PB5_UART1_TXD  0UL                 /*!< No ALT_MFP1 setting for PB.5 */
#define SYS_ALT_MFP2_PB5_UART1_TXD  0UL                 /*!< No ALT_MFP2 setting for PB.5 */
#define SYS_ALT_MFP3_PB5_UART1_TXD  0UL                 /*!< No ALT_MFP3 setting for PB.5 */
#define SYS_ALT_MFP4_PB5_UART1_TXD  0UL                 /*!< No ALT_MFP4 setting for PB.5 */

#define SYS_GPB_MFP_PB5_Msk         (1UL<<5)            /*!< GPB_MFP PB.5 mask */
#define SYS_ALT_MFP_PB5_Msk         0UL                 /*!< No ALT_MFP PB.5 mask */
#define SYS_ALT_MFP1_PB5_Msk        0UL                 /*!< No ALT_MFP1 PB.5 mask */
#define SYS_ALT_MFP2_PB5_Msk        0UL                 /*!< No ALT_MFP2 PB.5 mask */
#define SYS_ALT_MFP3_PB5_Msk        0UL                 /*!< No ALT_MFP3 PB.5 mask */
#define SYS_ALT_MFP4_PB5_Msk        0UL                 /*!< No ALT_MFP4 PB.5 mask */

//PB.6
#define SYS_GPB_MFP_PB6_GPIO        0x00000000UL        /*!< GPB_MFP PB.6 setting for GPIO */
#define SYS_ALT_MFP_PB6_GPIO        0UL                 /*!< No ALT_MFP setting for PB.6 */
#define SYS_ALT_MFP1_PB6_GPIO       0UL                 /*!< No ALT_MFP1 setting for PB.6 */
#define SYS_ALT_MFP2_PB6_GPIO       0UL                 /*!< No ALT_MFP2 setting for PB.6 */
#define SYS_ALT_MFP3_PB6_GPIO       0UL                 /*!< No ALT_MFP3 setting for PB.6 */
#define SYS_ALT_MFP4_PB6_GPIO       0UL                 /*!< No ALT_MFP4 setting for PB.6 */

#define SYS_GPB_MFP_PB6_UART1_nRTS      (1UL<<6)        /*!< GPB_MFP PB.6 setting for UART1_nRTS */
#define SYS_ALT_MFP_PB6_UART1_nRTS      0UL             /*!< No ALT_MFP setting for PB.6 */
#define SYS_ALT_MFP1_PB6_UART1_nRTS     0UL             /*!< No ALT_MFP1 setting for PB.6 */
#define SYS_ALT_MFP2_PB6_UART1_nRTS     0UL             /*!< No ALT_MFP2 setting for PB.6 */
#define SYS_ALT_MFP3_PB6_UART1_nRTS     0UL             /*!< No ALT_MFP3 setting for PB.6 */
#define SYS_ALT_MFP4_PB6_UART1_nRTS     0UL             /*!< No ALT_MFP4 setting for PB.6 */

#define SYS_GPB_MFP_PB6_Msk         (1UL<<6)            /*!< GPB_MFP PB.6 mask */
#define SYS_ALT_MFP_PB6_Msk         0UL                 /*!< No ALT_MFP PB.6 mask */
#define SYS_ALT_MFP1_PB6_Msk        0UL                 /*!< No ALT_MFP1 PB.6 mask */
#define SYS_ALT_MFP2_PB6_Msk        0UL                 /*!< No ALT_MFP2 PB.6 mask */
#define SYS_ALT_MFP3_PB6_Msk        0UL                 /*!< No ALT_MFP3 PB.6 mask */
#define SYS_ALT_MFP4_PB6_Msk        0UL                 /*!< No ALT_MFP4 PB.6 mask */

//PB.7
#define SYS_GPB_MFP_PB7_GPIO        0x00000000UL        /*!< GPB_MFP PB.7 setting for GPIO */
#define SYS_ALT_MFP_PB7_GPIO        0UL                 /*!< No ALT_MFP setting for PB.7 */
#define SYS_ALT_MFP1_PB7_GPIO       0UL                 /*!< No ALT_MFP1 setting for PB.7 */
#define SYS_ALT_MFP2_PB7_GPIO       0UL                 /*!< No ALT_MFP2 setting for PB.7 */
#define SYS_ALT_MFP3_PB7_GPIO       0UL                 /*!< No ALT_MFP3 setting for PB.7 */
#define SYS_ALT_MFP4_PB7_GPIO       0UL                 /*!< No ALT_MFP4 setting for PB.7 */

#define SYS_GPB_MFP_PB7_UART1_nCTS      (1UL<<7)        /*!< GPB_MFP PB.7 setting for UART1_nCTS */
#define SYS_ALT_MFP_PB7_UART1_nCTS      0UL             /*!< No ALT_MFP setting for PB.7 */
#define SYS_ALT_MFP1_PB7_UART1_nCTS     0UL             /*!< No ALT_MFP1 setting for PB.7 */
#define SYS_ALT_MFP2_PB7_UART1_nCTS     0UL             /*!< No ALT_MFP2 setting for PB.7 */
#define SYS_ALT_MFP3_PB7_UART1_nCTS     0UL             /*!< No ALT_MFP3 setting for PB.7 */
#define SYS_ALT_MFP4_PB7_UART1_nCTS     0UL             /*!< No ALT_MFP4 setting for PB.7 */

#define SYS_GPB_MFP_PB7_Msk         (1UL<<7)            /*!< GPB_MFP PB.7 mask */
#define SYS_ALT_MFP_PB7_Msk         0UL                 /*!< No ALT_MFP PB.7 mask */
#define SYS_ALT_MFP1_PB7_Msk        0UL                 /*!< No ALT_MFP1 PB.7 mask */
#define SYS_ALT_MFP2_PB7_Msk        0UL                 /*!< No ALT_MFP2 PB.7 mask */
#define SYS_ALT_MFP3_PB7_Msk        0UL                 /*!< No ALT_MFP3 PB.7 mask */
#define SYS_ALT_MFP4_PB7_Msk        0UL                 /*!< No ALT_MFP4 PB.7 mask */

//PB.8
#define SYS_GPB_MFP_PB8_GPIO        0x00000000UL        /*!< GPB_MFP PB.8 setting for GPIO */
#define SYS_ALT_MFP_PB8_GPIO        0x00000000UL        /*!< ALT_MFP PB.8 setting for GPIO */
#define SYS_ALT_MFP1_PB8_GPIO       0UL                 /*!< No ALT_MFP1 setting for PB.8 */
#define SYS_ALT_MFP2_PB8_GPIO       0UL                 /*!< No ALT_MFP2 setting for PB.8 */
#define SYS_ALT_MFP3_PB8_GPIO       0x00000000UL        /*!< ALT_MFP3 PB.8 setting for GPIO */
#define SYS_ALT_MFP4_PB8_GPIO       0UL                 /*!< No ALT_MFP4 setting for PB.8 */

