OpenNuvoton/NuTool-PinConfigure/Header/NUC1311/sys.h
#define SYS_GPC_MFP_PC9_Msk         (1UL<<9)            /*!< GPC_MFP PC.9 mask */
#define SYS_ALT_MFP_PC9_Msk         0UL                 /*!< No ALT_MFP PC.9 mask */
#define SYS_ALT_MFP1_PC9_Msk        0UL                 /*!< No ALT_MFP1 PC.9 mask */
#define SYS_ALT_MFP2_PC9_Msk        0UL                 /*!< No ALT_MFP2 PC.9 mask */
#define SYS_ALT_MFP3_PC9_Msk        0UL                 /*!< No ALT_MFP3 PC.9 mask */
#define SYS_ALT_MFP4_PC9_Msk        0UL                 /*!< No ALT_MFP4 PC.9 mask */

//PC.10
#define SYS_GPC_MFP_PC10_GPIO       0x00000000UL        /*!< GPC_MFP PC.10 setting for GPIO */
#define SYS_ALT_MFP_PC10_GPIO       0UL                 /*!< No ALT_MFP setting for PC.10 */
#define SYS_ALT_MFP1_PC10_GPIO      0UL                 /*!< No ALT_MFP1 setting for PC.10 */
#define SYS_ALT_MFP2_PC10_GPIO      0UL                 /*!< No ALT_MFP2 setting for PC.10 */
#define SYS_ALT_MFP3_PC10_GPIO      0UL                 /*!< No ALT_MFP3 setting for PC.10 */
#define SYS_ALT_MFP4_PC10_GPIO      0UL                 /*!< No ALT_MFP4 setting for PC.10 */

#define SYS_GPC_MFP_PC10_PWM1_BRAKE0    (1UL<<10)       /*!< GPC_MFP PC.10 setting for PWM1_BRAKE0 */
#define SYS_ALT_MFP_PC10_PWM1_BRAKE0    0UL             /*!< No ALT_MFP setting for PC.10 */
#define SYS_ALT_MFP1_PC10_PWM1_BRAKE0   0UL             /*!< No ALT_MFP1 setting for PC.10 */
#define SYS_ALT_MFP2_PC10_PWM1_BRAKE0   0UL             /*!< No ALT_MFP2 setting for PC.10 */
#define SYS_ALT_MFP3_PC10_PWM1_BRAKE0   0UL             /*!< No ALT_MFP3 setting for PC.10 */
#define SYS_ALT_MFP4_PC10_PWM1_BRAKE0   0UL             /*!< No ALT_MFP4 setting for PC.10 */

#define SYS_GPC_MFP_PC10_Msk        (1UL<<10)           /*!< GPC_MFP PC.10 mask */
#define SYS_ALT_MFP_PC10_Msk        0UL                 /*!< No ALT_MFP PC.10 mask */
#define SYS_ALT_MFP1_PC10_Msk       0UL                 /*!< No ALT_MFP1 PC.10 mask */
#define SYS_ALT_MFP2_PC10_Msk       0UL                 /*!< No ALT_MFP2 PC.10 mask */
#define SYS_ALT_MFP3_PC10_Msk       0UL                 /*!< No ALT_MFP3 PC.10 mask */
#define SYS_ALT_MFP4_PC10_Msk       0UL                 /*!< No ALT_MFP4 PC.10 mask */

//PC.11
#define SYS_GPC_MFP_PC11_GPIO       0x00000000UL        /*!< GPC_MFP PC.11 setting for GPIO */
#define SYS_ALT_MFP_PC11_GPIO       0UL                 /*!< No ALT_MFP setting for PC.11 */
#define SYS_ALT_MFP1_PC11_GPIO      0UL                 /*!< No ALT_MFP1 setting for PC.11 */
#define SYS_ALT_MFP2_PC11_GPIO      0UL                 /*!< No ALT_MFP2 setting for PC.11 */
#define SYS_ALT_MFP3_PC11_GPIO      0UL                 /*!< No ALT_MFP3 setting for PC.11 */
#define SYS_ALT_MFP4_PC11_GPIO      0UL                 /*!< No ALT_MFP4 setting for PC.11 */

#define SYS_GPC_MFP_PC11_PWM1_BRAKE1    (1UL<<11)       /*!< GPC_MFP PC.11 setting for PWM1_BRAKE1 */
#define SYS_ALT_MFP_PC11_PWM1_BRAKE1    0UL             /*!< No ALT_MFP setting for PC.11 */
#define SYS_ALT_MFP1_PC11_PWM1_BRAKE1   0UL             /*!< No ALT_MFP1 setting for PC.11 */
#define SYS_ALT_MFP2_PC11_PWM1_BRAKE1   0UL             /*!< No ALT_MFP2 setting for PC.11 */
#define SYS_ALT_MFP3_PC11_PWM1_BRAKE1   0UL             /*!< No ALT_MFP3 setting for PC.11 */
#define SYS_ALT_MFP4_PC11_PWM1_BRAKE1   0UL             /*!< No ALT_MFP4 setting for PC.11 */

#define SYS_GPC_MFP_PC11_Msk        (1UL<<11)           /*!< GPC_MFP PC.11 mask */
#define SYS_ALT_MFP_PC11_Msk        0UL                 /*!< No ALT_MFP PC.11 mask */
#define SYS_ALT_MFP1_PC11_Msk       0UL                 /*!< No ALT_MFP1 PC.11 mask */
#define SYS_ALT_MFP2_PC11_Msk       0UL                 /*!< No ALT_MFP2 PC.11 mask */
#define SYS_ALT_MFP3_PC11_Msk       0UL                 /*!< No ALT_MFP3 PC.11 mask */
#define SYS_ALT_MFP4_PC11_Msk       0UL                 /*!< No ALT_MFP4 PC.11 mask */

//PD.6
#define SYS_GPD_MFP_PD6_GPIO        0x00000000UL        /*!< GPD_MFP PD.6 setting for GPIO */
#define SYS_ALT_MFP_PD6_GPIO        0UL                 /*!< No ALT_MFP setting for PD.6 */
#define SYS_ALT_MFP1_PD6_GPIO       0UL                 /*!< No ALT_MFP1 setting for PD.6 */
#define SYS_ALT_MFP2_PD6_GPIO       0UL                 /*!< No ALT_MFP2 setting for PD.6 */
#define SYS_ALT_MFP3_PD6_GPIO       0x00000000UL        /*!< ALT_MFP3 PD.6 setting for GPIO */
#define SYS_ALT_MFP4_PD6_GPIO       0UL                 /*!< No ALT_MFP4 setting for PD.6 */

#define SYS_GPD_MFP_PD6_CAN0_RXD    (1UL<<6)            /*!< GPD_MFP PD.6 setting for CAN0_RXD */
#define SYS_ALT_MFP_PD6_CAN0_RXD    0UL                 /*!< No ALT_MFP setting for PD.6 */
#define SYS_ALT_MFP1_PD6_CAN0_RXD   0UL                 /*!< No ALT_MFP1 setting for PD.6 */
#define SYS_ALT_MFP2_PD6_CAN0_RXD   0UL                 /*!< No ALT_MFP2 setting for PD.6 */
#define SYS_ALT_MFP3_PD6_CAN0_RXD   0x00000000UL        /*!< ALT_MFP3 PD.6 setting for CAN0_RXD */
#define SYS_ALT_MFP4_PD6_CAN0_RXD   0UL                 /*!< No ALT_MFP4 setting for PD.6 */

#define SYS_GPD_MFP_PD6_BPWM1_CH1   (1UL<<6)            /*!< GPD_MFP PD.6 setting for BPWM1_CH1 */
#define SYS_ALT_MFP_PD6_BPWM1_CH1   0UL                 /*!< No ALT_MFP setting for PD.6 */
#define SYS_ALT_MFP1_PD6_BPWM1_CH1  0UL                 /*!< No ALT_MFP1 setting for PD.6 */
#define SYS_ALT_MFP2_PD6_BPWM1_CH1  0UL                 /*!< No ALT_MFP2 setting for PD.6 */
#define SYS_ALT_MFP3_PD6_BPWM1_CH1  (1UL<<19)           /*!< ALT_MFP3 PD.6 setting for BPWM1_CH1 */
#define SYS_ALT_MFP4_PD6_BPWM1_CH1  0UL                 /*!< No ALT_MFP4 setting for PD.6 */

#define SYS_GPD_MFP_PD6_Msk         (1UL<<6)            /*!< GPD_MFP PD.6 mask */
#define SYS_ALT_MFP_PD6_Msk         0UL                 /*!< No ALT_MFP PD.6 mask */
#define SYS_ALT_MFP1_PD6_Msk        0UL                 /*!< No ALT_MFP1 PD.6 mask */
#define SYS_ALT_MFP2_PD6_Msk        0UL                 /*!< No ALT_MFP2 PD.6 mask */
#define SYS_ALT_MFP3_PD6_Msk        (1UL<<19)           /*!< ALT_MFP3 PD.6 mask */
#define SYS_ALT_MFP4_PD6_Msk        0UL                 /*!< No ALT_MFP4 PD.6 mask */

