OpenNuvoton/NuTool-PinConfigure/Header/NUC1311/sys.h
#define SYS_GPE_MFP_PE5_TM1         (1UL<<5)            /*!< GPE_MFP PE.5 setting for TM1 */
#define SYS_ALT_MFP_PE5_TM1         0x00000000UL        /*!< ALT_MFP PE.5 setting for TM1 */
#define SYS_ALT_MFP1_PE5_TM1        0UL                 /*!< No ALT_MFP1 setting for PE.5 */
#define SYS_ALT_MFP2_PE5_TM1        (1UL<<3)            /*!< ALT_MFP2 PE.5 setting for TM1 */
#define SYS_ALT_MFP3_PE5_TM1        0UL                 /*!< No ALT_MFP3 setting for PE.5 */
#define SYS_ALT_MFP4_PE5_TM1        0UL                 /*!< No ALT_MFP4 setting for PE.5 */

#define SYS_GPE_MFP_PE5_TM1_EXT     (1UL<<5)            /*!< GPE_MFP PE.5 setting for TM1_EXT */
#define SYS_ALT_MFP_PE5_TM1_EXT     (1UL<<25)           /*!< ALT_MFP PE.5 setting for TM1_EXT */
#define SYS_ALT_MFP1_PE5_TM1_EXT    0UL                 /*!< No ALT_MFP1 setting for PE.5_EXT */
#define SYS_ALT_MFP2_PE5_TM1_EXT    0x00000000UL        /*!< ALT_MFP2 PE.5 setting for TM1_EXT */
#define SYS_ALT_MFP3_PE5_TM1_EXT    0UL                 /*!< No ALT_MFP3 setting for PE.5 */
#define SYS_ALT_MFP4_PE5_TM1_EXT    0UL                 /*!< No ALT_MFP4 setting for PE.5 */

#define SYS_GPE_MFP_PE5_Msk         (1UL<<5)            /*!< GPE_MFP PE.5 mask */
#define SYS_ALT_MFP_PE5_Msk         (1UL<<25)           /*!< ALT_MFP PE.5 mask */
#define SYS_ALT_MFP1_PE5_Msk        0UL                 /*!< No ALT_MFP1 PE.5 mask */
#define SYS_ALT_MFP2_PE5_Msk        (1UL<<3)            /*!< ALT_MFP2 PE.5 mask */
#define SYS_ALT_MFP3_PE5_Msk        0UL                 /*!< No ALT_MFP3 PE.5 mask */
#define SYS_ALT_MFP4_PE5_Msk        0UL                 /*!< No ALT_MFP4 PE.5 mask */

//PF.0
#define SYS_GPF_MFP_PF0_GPIO        0x00000000UL        /*!< GPF_MFP PF.0 setting for GPIO */
#define SYS_ALT_MFP_PF0_GPIO        0UL                 /*!< No ALT_MFP setting for PF.0 */
#define SYS_ALT_MFP1_PF0_GPIO       0UL                 /*!< No ALT_MFP1 setting for PF.0 */
#define SYS_ALT_MFP2_PF0_GPIO       0UL                 /*!< No ALT_MFP2 setting for PF.0 */
#define SYS_ALT_MFP3_PF0_GPIO       0UL                 /*!< No ALT_MFP3 setting for PF.0 */
#define SYS_ALT_MFP4_PF0_GPIO       0UL                 /*!< No ALT_MFP4 setting for PF.0 */

#define SYS_GPF_MFP_PF0_XT1_OUT     (1UL<<0)            /*!< GPF_MFP PF.0 setting for XT1_OUT */
#define SYS_ALT_MFP_PF0_XT1_OUT     0UL                 /*!< No ALT_MFP setting for PF.0 */
#define SYS_ALT_MFP1_PF0_XT1_OUT    0UL                 /*!< No ALT_MFP1 setting for PF.0 */
#define SYS_ALT_MFP2_PF0_XT1_OUT    0UL                 /*!< No ALT_MFP2 setting for PF.0 */
#define SYS_ALT_MFP3_PF0_XT1_OUT    0UL                 /*!< No ALT_MFP3 setting for PF.0 */
#define SYS_ALT_MFP4_PF0_XT1_OUT    0UL                 /*!< No ALT_MFP4 setting for PF.0 */

#define SYS_GPF_MFP_PF0_Msk         (1UL<<0)            /*!< GPE_MFP PF.0 mask */
#define SYS_ALT_MFP_PF0_Msk         0UL                 /*!< No ALT_MFP PF.0 mask */
#define SYS_ALT_MFP1_PF0_Msk        0UL                 /*!< No ALT_MFP1 PF.0 mask */
#define SYS_ALT_MFP2_PF0_Msk        0UL                 /*!< No ALT_MFP2 PF.0 mask */
#define SYS_ALT_MFP3_PF0_Msk        0UL                 /*!< No ALT_MFP3 PF.0 mask */
#define SYS_ALT_MFP4_PF0_Msk        0UL                 /*!< No ALT_MFP4 PF.0 mask */

//PF.1
#define SYS_GPF_MFP_PF1_GPIO        0x00000000UL        /*!< GPF_MFP PF.1 setting for GPIO */
#define SYS_ALT_MFP_PF1_GPIO        0UL                 /*!< No ALT_MFP setting for PF.1 */
#define SYS_ALT_MFP1_PF1_GPIO       0UL                 /*!< No ALT_MFP1 setting for PF.1 */
#define SYS_ALT_MFP2_PF1_GPIO       0UL                 /*!< No ALT_MFP2 setting for PF.1 */
#define SYS_ALT_MFP3_PF1_GPIO       0UL                 /*!< No ALT_MFP3 setting for PF.1 */
#define SYS_ALT_MFP4_PF1_GPIO       0UL                 /*!< No ALT_MFP4 setting for PF.1 */

#define SYS_GPF_MFP_PF1_XT1_IN      (1UL<<1)            /*!< GPF_MFP PF.1 setting for XT1_IN */
#define SYS_ALT_MFP_PF1_XT1_IN      0UL                 /*!< No ALT_MFP setting for PF.1 */
#define SYS_ALT_MFP1_PF1_XT1_IN     0UL                 /*!< No ALT_MFP1 setting for PF.1 */
#define SYS_ALT_MFP2_PF1_XT1_IN     0UL                 /*!< No ALT_MFP2 setting for PF.1 */
#define SYS_ALT_MFP3_PF1_XT1_IN     0UL                 /*!< No ALT_MFP3 setting for PF.1 */
#define SYS_ALT_MFP4_PF1_XT1_IN     0UL                 /*!< No ALT_MFP4 setting for PF.1 */

#define SYS_GPF_MFP_PF1_Msk         (1UL<<1)            /*!< GPE_MFP PF.1 mask */
#define SYS_ALT_MFP_PF1_Msk         0UL                 /*!< No ALT_MFP PF.1 mask */
#define SYS_ALT_MFP1_PF1_Msk        0UL                 /*!< No ALT_MFP1 PF.1 mask */
#define SYS_ALT_MFP2_PF1_Msk        0UL                 /*!< No ALT_MFP2 PF.1 mask */
#define SYS_ALT_MFP3_PF1_Msk        0UL                 /*!< No ALT_MFP3 PF.1 mask */
#define SYS_ALT_MFP4_PF1_Msk        0UL                 /*!< No ALT_MFP4 PF.1 mask */

//PF.4
#define SYS_GPF_MFP_PF4_GPIO        0x00000000UL        /*!< GPF_MFP PF.4 setting for GPIO */
#define SYS_ALT_MFP_PF4_GPIO        0UL                 /*!< No ALT_MFP setting for PF.4 */
#define SYS_ALT_MFP1_PF4_GPIO       0UL                 /*!< No ALT_MFP1 setting for PF.4 */
#define SYS_ALT_MFP2_PF4_GPIO       0UL                 /*!< No ALT_MFP2 setting for PF.4 */
#define SYS_ALT_MFP3_PF4_GPIO       0x00000000UL        /*!< ALT_MFP3 PF.4 setting for GPIO */
#define SYS_ALT_MFP4_PF4_GPIO       0UL                 /*!< No ALT_MFP4 setting for PF.4 */

#define SYS_GPF_MFP_PF4_I2C0_SDA    (1UL<<4)            /*!< GPF_MFP PF.4 setting for I2C0_SDA */
#define SYS_ALT_MFP_PF4_I2C0_SDA    0UL                 /*!< No ALT_MFP setting for PF.4 */
#define SYS_ALT_MFP1_PF4_I2C0_SDA   0UL                 /*!< No ALT_MFP1 setting for PF.4 */
#define SYS_ALT_MFP2_PF4_I2C0_SDA   0UL                 /*!< No ALT_MFP2 setting for PF.4 */
#define SYS_ALT_MFP3_PF4_I2C0_SDA   0x00000000UL        /*!< ALT_MFP3 PF.4 setting for I2C0_SDA */
#define SYS_ALT_MFP4_PF4_I2C0_SDA   0UL                 /*!< No ALT_MFP4 setting for PF.4 */

#define SYS_GPF_MFP_PF4_PWM1_CH4    (1UL<<4)            /*!< GPF_MFP PF.4 setting for PWM1_CH4 */
#define SYS_ALT_MFP_PF4_PWM1_CH4    0UL                 /*!< No ALT_MFP setting for PF.4 */
#define SYS_ALT_MFP1_PF4_PWM1_CH4   0UL                 /*!< No ALT_MFP1 setting for PF.4 */
#define SYS_ALT_MFP2_PF4_PWM1_CH4   0UL                 /*!< No ALT_MFP2 setting for PF.4 */
#define SYS_ALT_MFP3_PF4_PWM1_CH4   (1UL<<10)           /*!< ALT_MFP3 PF.4 setting for PWM1_CH4 */
#define SYS_ALT_MFP4_PF4_PWM1_CH4   0UL                 /*!< No ALT_MFP4 setting for PF.4 */

#define SYS_GPF_MFP_PF4_Msk         (1UL<<4)            /*!< GPF_MFP PF.4 mask */
#define SYS_ALT_MFP_PF4_Msk         0UL                 /*!< No ALT_MFP PF.4 mask */
#define SYS_ALT_MFP1_PF4_Msk        0UL                 /*!< No ALT_MFP1 PF.4 mask */
#define SYS_ALT_MFP2_PF4_Msk        0UL                 /*!< No ALT_MFP2 PF.4 mask */
#define SYS_ALT_MFP3_PF4_Msk        (1UL<<10)           /*!< ALT_MFP3 PF.4 mask */
#define SYS_ALT_MFP4_PF4_Msk        0UL                 /*!< No ALT_MFP4 PF.4 mask */

//PF.5
#define SYS_GPF_MFP_PF5_GPIO        0x00000000UL        /*!< GPF_MFP PF.5 setting for GPIO */
#define SYS_ALT_MFP_PF5_GPIO        0UL                 /*!< No ALT_MFP setting for PF.5 */
#define SYS_ALT_MFP1_PF5_GPIO       0UL                 /*!< No ALT_MFP1 setting for PF.5 */
#define SYS_ALT_MFP2_PF5_GPIO       0UL                 /*!< No ALT_MFP2 setting for PF.5 */
#define SYS_ALT_MFP3_PF5_GPIO       0x00000000UL        /*!< ALT_MFP3 PF.5 setting for GPIO */
#define SYS_ALT_MFP4_PF5_GPIO       0UL                 /*!< No ALT_MFP4 setting for PF.5 */

#define SYS_GPF_MFP_PF5_I2C0_SCL    (1UL<<5)            /*!< GPF_MFP PF.5 setting for I2C0_SCL */
#define SYS_ALT_MFP_PF5_I2C0_SCL    0UL                 /*!< No ALT_MFP setting for PF.5 */
#define SYS_ALT_MFP1_PF5_I2C0_SCL   0UL                 /*!< No ALT_MFP1 setting for PF.5 */
#define SYS_ALT_MFP2_PF5_I2C0_SCL   0UL                 /*!< No ALT_MFP2 setting for PF.5 */
#define SYS_ALT_MFP3_PF5_I2C0_SCL   0x00000000UL        /*!< ALT_MFP3 PF.5 setting for I2C0_SCL */
#define SYS_ALT_MFP4_PF5_I2C0_SCL   0UL                 /*!< No ALT_MFP4 setting for PF.5 */

#define SYS_GPF_MFP_PF5_PWM1_CH5    (1UL<<5)            /*!< GPF_MFP PF.5 setting for PWM1_CH5 */
#define SYS_ALT_MFP_PF5_PWM1_CH5    0UL                 /*!< No ALT_MFP setting for PF.6 */
#define SYS_ALT_MFP1_PF5_PWM1_CH5   0UL                 /*!< No ALT_MFP1 setting for PF.5 */
#define SYS_ALT_MFP2_PF5_PWM1_CH5   0UL                 /*!< No ALT_MFP2 setting for PF.5 */
#define SYS_ALT_MFP3_PF5_PWM1_CH5   (1UL<<11)           /*!< ALT_MFP3 PF.5 setting for PWM1_CH5 */
#define SYS_ALT_MFP4_PF5_PWM1_CH5   0UL                 /*!< No ALT_MFP4 setting for PF.5 */

#define SYS_GPF_MFP_PF5_Msk         (1UL<<5)            /*!< GPF_MFP PF.5 mask */
#define SYS_ALT_MFP_PF5_Msk         0UL                 /*!< No ALT_MFP PF.5 mask */
#define SYS_ALT_MFP1_PF5_Msk        0UL                 /*!< No ALT_MFP1 PF.5 mask */
#define SYS_ALT_MFP2_PF5_Msk        0UL                 /*!< No ALT_MFP2 PF.5 mask */
#define SYS_ALT_MFP3_PF5_Msk        (1UL<<11)           /*!< ALT_MFP3 PF.5 mask */
#define SYS_ALT_MFP4_PF5_Msk        0UL                 /*!< No ALT_MFP4 PF.5 mask */

