OpenNuvoton/NuTool-PinConfigure/Header/NUC1311/sys.h
//PF.6
#define SYS_GPF_MFP_PF6_GPIO        0x00000000UL        /*!< GPF_MFP PF.6 setting for GPIO */
#define SYS_ALT_MFP_PF6_GPIO        0UL                 /*!< No ALT_MFP setting for PF.6 */
#define SYS_ALT_MFP1_PF6_GPIO       0UL                 /*!< No ALT_MFP1 setting for PF.6 */
#define SYS_ALT_MFP2_PF6_GPIO       0UL                 /*!< No ALT_MFP2 setting for PF.6 */
#define SYS_ALT_MFP3_PF6_GPIO       0UL                 /*!< No ALT_MFP3 setting for PF.6 */
#define SYS_ALT_MFP4_PF6_GPIO       0UL                 /*!< No ALT_MFP4 setting for PF.6 */

#define SYS_GPF_MFP_PF6_ICE_CLK     (1UL<<6)            /*!< GPF_MFP PF.6 setting for ICE_CLK */
#define SYS_ALT_MFP_PF6_ICE_CLK     0UL                 /*!< No ALT_MFP setting for PF.6 */
#define SYS_ALT_MFP1_PF6_ICE_CLK    0UL                 /*!< No ALT_MFP1 setting for PF.6 */
#define SYS_ALT_MFP2_PF6_ICE_CLK    0UL                 /*!< No ALT_MFP2 setting for PF.6 */
#define SYS_ALT_MFP3_PF6_ICE_CLK    0UL                 /*!< No ALT_MFP3 setting for PF.6 */
#define SYS_ALT_MFP4_PF6_ICE_CLK    0UL                 /*!< No ALT_MFP4 setting for PF.6 */

#define SYS_GPF_MFP_PF6_Msk         (1UL<<6)            /*!< GPF_MFP PF.6 mask */
#define SYS_ALT_MFP_PF6_Msk         0UL                 /*!< No ALT_MFP PF.6 mask */
#define SYS_ALT_MFP1_PF6_Msk        0UL                 /*!< No ALT_MFP1 PF.6 mask */
#define SYS_ALT_MFP2_PF6_Msk        0UL                 /*!< No ALT_MFP2 PF.6 mask */
#define SYS_ALT_MFP3_PF6_Msk        0UL                 /*!< No ALT_MFP3 PF.6 mask */
#define SYS_ALT_MFP4_PF6_Msk        0UL                 /*!< No ALT_MFP4 PF.6 mask */

//PF.7
#define SYS_GPF_MFP_PF7_GPIO        0x00000000UL        /*!< GPF_MFP PF.7 setting for GPIO */
#define SYS_ALT_MFP_PF7_GPIO        0UL                 /*!< No ALT_MFP setting for PF.7 */
#define SYS_ALT_MFP1_PF7_GPIO       0UL                 /*!< No ALT_MFP1 setting for PF.7 */
#define SYS_ALT_MFP2_PF7_GPIO       0UL                 /*!< No ALT_MFP2 setting for PF.7 */
#define SYS_ALT_MFP3_PF7_GPIO       0UL                 /*!< No ALT_MFP3 setting for PF.7 */
#define SYS_ALT_MFP4_PF7_GPIO       0UL                 /*!< No ALT_MFP4 setting for PF.7 */

#define SYS_GPF_MFP_PF7_ICE_DAT     (1UL<<7)            /*!< GPF_MFP PF.7 setting for ICE_DAT */
#define SYS_ALT_MFP_PF7_ICE_DAT     0UL                 /*!< No ALT_MFP setting for PF.7 */
#define SYS_ALT_MFP1_PF7_ICE_DAT    0UL                 /*!< No ALT_MFP1 setting for PF.7 */
#define SYS_ALT_MFP2_PF7_ICE_DAT    0UL                 /*!< No ALT_MFP2 setting for PF.7 */
#define SYS_ALT_MFP3_PF7_ICE_DAT    0UL                 /*!< No ALT_MFP3 setting for PF.7 */
#define SYS_ALT_MFP4_PF7_ICE_DAT    0UL                 /*!< No ALT_MFP4 setting for PF.7 */

#define SYS_GPF_MFP_PF7_Msk         (1UL<<7)            /*!< GPF_MFP PF.7 mask */
#define SYS_ALT_MFP_PF7_Msk         0UL                 /*!< No ALT_MFP PF.7 mask */
#define SYS_ALT_MFP1_PF7_Msk        0UL                 /*!< No ALT_MFP1 PF.7 mask */
#define SYS_ALT_MFP2_PF7_Msk        0UL                 /*!< No ALT_MFP2 PF.7 mask */
#define SYS_ALT_MFP3_PF7_Msk        0UL                 /*!< No ALT_MFP3 PF.7 mask */
#define SYS_ALT_MFP4_PF7_Msk        0UL                 /*!< No ALT_MFP4 PF.7 mask */

//PF.8
#define SYS_GPF_MFP_PF8_GPIO        0x00000000UL        /*!< GPF_MFP PF.8 setting for GPIO */
#define SYS_ALT_MFP_PF8_GPIO        0UL                 /*!< No ALT_MFP setting for PF.8 */
#define SYS_ALT_MFP1_PF8_GPIO       0UL                 /*!< No ALT_MFP1 setting for PF.8 */
#define SYS_ALT_MFP2_PF8_GPIO       0UL                 /*!< No ALT_MFP2 setting for PF.8 */
#define SYS_ALT_MFP3_PF8_GPIO       0x00000000UL        /*!< ALT_MFP3 PF.8 setting for GPIO */
#define SYS_ALT_MFP4_PF8_GPIO       0UL                 /*!< No ALT_MFP4 setting for PF.8 */

#define SYS_GPF_MFP_PF8_CLKO        (1UL<<8)            /*!< GPF_MFP PF.8 setting for CLKO */
#define SYS_ALT_MFP_PF8_CLKO        0UL                 /*!< No ALT_MFP setting for PF.8 */
#define SYS_ALT_MFP1_PF8_CLKO       0UL                 /*!< No ALT_MFP1 setting for PF.8 */
#define SYS_ALT_MFP2_PF8_CLKO       0UL                 /*!< No ALT_MFP2 setting for PF.8 */
#define SYS_ALT_MFP3_PF8_CLKO       0x00000000UL        /*!< ALT_MFP3 PF.8 setting for CLKO */
#define SYS_ALT_MFP4_PF8_CLKO       0UL                 /*!< No ALT_MFP4 setting for PF.8 */

#define SYS_GPF_MFP_PF8_BPWM1_CH4       0x00000000UL    /*!< GPF_MFP PF.8 setting for BPWM1_CH4 */
#define SYS_ALT_MFP_PF8_BPWM1_CH4       0UL             /*!< No ALT_MFP setting for PF.8 */
#define SYS_ALT_MFP1_PF8_BPWM1_CH4      0UL             /*!< No ALT_MFP1 setting for PF.8 */
#define SYS_ALT_MFP2_PF8_BPWM1_CH4      0UL             /*!< No ALT_MFP2 setting for PF.8 */
#define SYS_ALT_MFP3_PF8_BPWM1_CH4      (1UL<<22)       /*!< ALT_MFP3 PF.8 setting for BPWM1_CH4 */
#define SYS_ALT_MFP4_PF8_BPWM1_CH4      0UL             /*!< No ALT_MFP4 setting for PF.8 */

#define SYS_GPF_MFP_PF8_Msk         (1UL<<8)            /*!< GPF_MFP PF.8 mask */
#define SYS_ALT_MFP_PF8_Msk         0UL                 /*!< No ALT_MFP PF.8 mask */
#define SYS_ALT_MFP1_PF8_Msk        0UL                 /*!< No ALT_MFP1 PF.8 mask */
#define SYS_ALT_MFP2_PF8_Msk        0UL                 /*!< No ALT_MFP2 PF.8 mask */
#define SYS_ALT_MFP3_PF8_Msk        (1UL<<22)           /*!< ALT_MFP3 PF.8 mask */
#define SYS_ALT_MFP4_PF8_Msk        0UL                 /*!< No ALT_MFP4 PF.8 mask */


/*@}*/ /* end of group SYS_EXPORTED_CONSTANTS */

/** @addtogroup SYS_EXPORTED_FUNCTIONS SYS Exported Functions
  @{
*/


/**
  * @brief      Clear Brown-out detector interrupt flag
  * @param      None
  * @return     None
  * @details    This macro clear Brown-out detector interrupt flag.
  */
#define SYS_CLEAR_BOD_INT_FLAG()        (SYS->BODCR |= SYS_BODCR_BOD_INTF_Msk)

/**
  * @brief      Set Brown-out detector function to normal mode
  * @param      None
  * @return     None
  * @details    This macro set Brown-out detector to normal mode.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_CLEAR_BOD_LPM()             (SYS->BODCR &= ~SYS_BODCR_BOD_LPM_Msk)

/**
  * @brief      Disable Brown-out detector function
  * @param      None
  * @return     None
  * @details    This macro disable Brown-out detector function.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_DISABLE_BOD()               (SYS->BODCR &= ~SYS_BODCR_BOD_EN_Msk)

/**
  * @brief      Enable Brown-out detector function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detector function.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_ENABLE_BOD()                (SYS->BODCR |= SYS_BODCR_BOD_EN_Msk)

/**
  * @brief      Get Brown-out detector interrupt flag
  * @param      None
  * @retval     0   Brown-out detect interrupt flag is not set.
  * @retval     >=1 Brown-out detect interrupt flag is set.
  * @details    This macro get Brown-out detector interrupt flag.
  */
#define SYS_GET_BOD_INT_FLAG()          (SYS->BODCR & SYS_BODCR_BOD_INTF_Msk)

/**
  * @brief      Get Brown-out detector status
  * @param      None
  * @retval     0   System voltage is higher than BOD threshold voltage setting or BOD function is disabled.
  * @retval     >=1 System voltage is lower than BOD threshold voltage setting.
  * @details    This macro get Brown-out detector output status.
  *             If the BOD function is disabled, this function always return 0.
  */
#define SYS_GET_BOD_OUTPUT()            (SYS->BODCR & SYS_BODCR_BOD_OUT_Msk)

/**
  * @brief      Enable Brown-out detector interrupt function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detector interrupt function.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_DISABLE_BOD_RST()           (SYS->BODCR &= ~SYS_BODCR_BOD_RSTEN_Msk)

/**
  * @brief      Enable Brown-out detector reset function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detect reset function.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_ENABLE_BOD_RST()            (SYS->BODCR |= SYS_BODCR_BOD_RSTEN_Msk)

/**
  * @brief      Set Brown-out detector function low power mode
  * @param      None
  * @return     None
  * @details    This macro set Brown-out detector to low power mode.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_SET_BOD_LPM()               (SYS->BODCR |= SYS_BODCR_BOD_LPM_Msk)

/**
  * @brief      Set Brown-out detector voltage level
  * @param[in]  u32Level is Brown-out voltage level. Including :
  *             - \ref SYS_BODCR_BOD_VL_4_4V
  *             - \ref SYS_BODCR_BOD_VL_3_7V
  *             - \ref SYS_BODCR_BOD_VL_2_7V
  *             - \ref SYS_BODCR_BOD_VL_2_2V
  * @return     None
  * @details    This macro set Brown-out detector voltage level.
  *             The write-protection function should be disabled before using this macro.
  */
#define SYS_SET_BOD_LEVEL(u32Level)     (SYS->BODCR = (SYS->BODCR & ~SYS_BODCR_BOD_VL_Msk) | (u32Level))

/**
  * @brief      Get reset source is from Brown-out detector reset
  * @param      None
  * @retval     0   Previous reset source is not from Brown-out detector reset
  * @retval     >=1 Previous reset source is from Brown-out detector reset
  * @details    This macro get previous reset source is from Brown-out detect reset or not.
  */
#define SYS_IS_BOD_RST()                (SYS->RSTSRC & SYS_RSTSRC_RSTS_BOD_Msk)

/**
  * @brief      Get reset source is from CPU reset
  * @param      None
  * @retval     0   Previous reset source is not from CPU reset
  * @retval     >=1 Previous reset source is from CPU reset
  * @details    This macro get previous reset source is from CPU reset.
  */
#define SYS_IS_CPU_RST()                (SYS->RSTSRC & SYS_RSTSRC_RSTS_CPU_Msk)

/**
  * @brief      Get reset source is from Low-Voltage-Reset
  * @param      None
  * @retval     0   Previous reset source is not from Low-Voltage-Reset
  * @retval     >=1 Previous reset source is from Low-Voltage-Reset
  * @details    This macro get previous reset source is from Low-Voltage-Reset.
  */
#define SYS_IS_LVR_RST()                (SYS->RSTSRC & SYS_RSTSRC_RSTS_LVR_Msk)

/**
  * @brief      Get reset source is from Power-on Reset
  * @param      None
  * @retval     0   Previous reset source is not from Power-on Reset
  * @retval     >=1 Previous reset source is from Power-on Reset
  * @details    This macro get previous reset source is from Power-on Reset.
  */
#define SYS_IS_POR_RST()                (SYS->RSTSRC & SYS_RSTSRC_RSTS_POR_Msk)

/**
  * @brief      Get reset source is from reset pin reset
  * @param      None
  * @retval     0   Previous reset source is not from reset pin reset
  * @retval     >=1 Previous reset source is from reset pin reset
  * @details    This macro get previous reset source is from reset pin reset.
  */
#define SYS_IS_RSTPIN_RST()             (SYS->RSTSRC & SYS_RSTSRC_RSTS_RESET_Msk)

/**
  * @brief      Get reset source is from system reset
  * @param      None
  * @retval     0   Previous reset source is not from system reset
  * @retval     >=1 Previous reset source is from system reset
  * @details    This macro get previous reset source is from system reset.
  */
#define SYS_IS_SYSTEM_RST()             (SYS->RSTSRC & SYS_RSTSRC_RSTS_SYS_Msk)

/**
  * @brief      Get reset source is from window watch dog reset
  * @param      None
  * @retval     0   Previous reset source is not from window watch dog reset
  * @retval     >=1 Previous reset source is from window watch dog reset
  * @details    This macro get previous reset source is from window watch dog reset.
  */
#define SYS_IS_WDT_RST()                (SYS->RSTSRC & SYS_RSTSRC_RSTS_WDT_Msk)

/**
  * @brief      Disable Low-Voltage-Reset function
  * @param      None
  * @return     None
  * @details    This macro disable Low-Voltage-Reset function.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_DISABLE_LVR()               (SYS->BODCR &= ~SYS_BODCR_LVR_EN_Msk)

/**
  * @brief      Enable Low-Voltage-Reset function
  * @param      None
  * @return     None
  * @details    This macro enable Low-Voltage-Reset function.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_ENABLE_LVR()                (SYS->BODCR |= SYS_BODCR_LVR_EN_Msk)

/**
  * @brief      Disable Power-on Reset function
  * @param      None
  * @return     None
  * @details    This macro disable Power-on Reset function.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_DISABLE_POR()               (SYS->PORCR = 0x5AA5)

/**
  * @brief      Enable Power-on Reset function
  * @param      None
  * @return     None
  * @details    This macro enable Power-on Reset function.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_ENABLE_POR()                (SYS->PORCR = 0)

/**
  * @brief      Clear reset source flag
  * @param[in]  u32RstSrc is reset source. Including:
  *             - \ref SYS_RSTSRC_RSTS_CPU_Msk
  *             - \ref SYS_RSTSRC_RSTS_SYS_Msk
  *             - \ref SYS_RSTSRC_RSTS_BOD_Msk
  *             - \ref SYS_RSTSRC_RSTS_LVR_Msk
  *             - \ref SYS_RSTSRC_RSTS_WDT_Msk
  *             - \ref SYS_RSTSRC_RSTS_RESET_Msk
  *             - \ref SYS_RSTSRC_RSTS_POR_Msk
  * @return     None
  * @details    This macro clear reset source flag.
  */
#define SYS_CLEAR_RST_SOURCE(u32RstSrc) (SYS->RSTSRC = (u32RstSrc) )


/**
  * @brief      Enable register write-protection function
  * @param      None
  * @return     None
  * @details    This function enable register write-protection function.
  *             To lock the protected register to forbid write access.
  */
static __INLINE void SYS_LockReg(void)
{
    SYS->REGWRPROT = 0;
}

/**
  * @brief      Disable register write-protection function
  * @param      None
  * @return     None
  * @details    This function disable register write-protection function.
  *             To unlock the protected register to allow write access.
  *
  */
static __INLINE void SYS_UnlockReg(void)
{
    while(SYS->REGWRPROT != SYS_REGWRPROT_REGPROTDIS_Msk)
    {
        SYS->REGWRPROT = 0x59;
        SYS->REGWRPROT = 0x16;
        SYS->REGWRPROT = 0x88;
    }
}


void SYS_ClearResetSrc(uint32_t u32Src);
uint32_t SYS_GetBODStatus(void);
uint32_t SYS_GetResetSrc(void);
uint32_t SYS_IsRegLocked(void);
uint32_t  SYS_ReadPDID(void);
void SYS_ResetChip(void);
void SYS_ResetCPU(void);
void SYS_ResetModule(uint32_t u32ModuleIndex);
void SYS_EnableBOD(int32_t i32Mode, uint32_t u32BODLevel);
void SYS_DisableBOD(void);


/*@}*/ /* end of group SYS_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group SYS_Driver */

/*@}*/ /* end of group Device_Driver */


#ifdef __cplusplus
}
#endif

#endif //__SYS_H__

